{
   "ar": "<h1 dir='rtl' style='text-align:justify'><span style='font-size:48px'><span style='color:#f39c12'>&nbsp; سامراء في التاريخ واللغة &nbsp;</span></span></h1><p dir='rtl' style='text-align:justify'>&nbsp;</p><p dir='rtl' style='text-align:justify'><img alt='' src='https://www.atlastours.net/iraq/alaskareyya_shrine.jpg' style='height:349px; width:560px' /></p><p dir='rtl' style='text-align:justify'>&nbsp;</p><p dir='rtl' style='text-align:justify'><span style='font-size:18px'>يعود أصل اسم (سامراء) في أصله إلى سائر الأسماء الآرامية بالعراق التي كانت تنتهي بحرف الألف المقصور مثل (كربلا) (بعقوبا) وفي مراحل تاريخية لاحقة من تاريخ اللغة العربية التي ورثت تلك التسميات لبعض مدنها في أرض الرافدين أضيفت علامة الهمزة إلى مفردتي (سامرا) و(كربلا) فأصبحتا (سامراء وكربلاء) في حين استبدل حرف الألف بحرف التاء من اسم مدينة بعقوبا فأضحى يكتب (بعقوبة) ومعلوم أن مدينة سامراء في معظم تاريخ الدولة العباسية كانت باهرة في مشاهدها وعامرة في بناءها حتى كان قد أُطلق عليها زمنذاك بـ(سّره مَنْ رأى) قبل أن تُدمج حروف تلك التسمية بصيغة (سامراء). ويعود اكتشاف مدينة سامراء إلى عصور قديمة فقد ذكرها المؤرخ الروماني أميانس مرقلينس (320&ndash;390م) بصيغة (سومرا sumera) ونوه عنها المؤرخ اليوناني زوسيمس بصورة سوما saoma وفي التدوينات الآشورية جاء ذكر اسمها بصيغة (سرمارتا suurmrta) في حين ورد اسم سامراء في مصنفات الإخوة السريان على كونه (شومرا) وتم كل ذلك قبل يبنيها مجدداً الحاكم العباسي المعتصم.&nbsp;</span></p><p dir='rtl' style='text-align:justify'><span style='font-size:18px'>الموقع الجغرافي&nbsp; تقع المدينة على الضفة الشرقية لنهر دجلة وتبعد نحو 118 كم إلى الشمال من العاصمة بغداد، وتقع على خط طول 43 درجة و45 دقيقة، وعلى خط عرض 34 درجة و35 دقيقة، وقد كانت مدينة سامراء قضاءً تابعاً إلى لواء (محافظة) بغداد عند تأسيس الدولة العراقية الحديثة عام 1920م إثر ثورة العشرين العراقية الكبرى، وكانت تتبع لها نواحي (تكريت، بلد، الدجيل)، وقد قام النظام السابق باستحداث محافظة صلاح الدين أوائل السبعينيات، لتضم كل المدن التابعة لقضاء سامراء ومدن أخرى وقرى من محافظتي كركوك ونينوى، وبدلاً من جعل سامراء مركزاً للمحافظة الجديدة، وسّع ناحية تكريت وجعلها قضاءً ثم مركزاً للمحافظة الجديدة والتي تبعت لها مدينة سامراء، وأصبحت المحافظة الجديدة تضم سامراء كقضاء تابعٍ لتكريت مركز المحافظة الجديدة التي أصبحت مجاورة للمحافظات التالية: محافظات-السليمانية-وكركوك-وأربيل-ونينوى-صلاح الدين من الشمال والشمال الغربي, محافظة بغداد من الجنوب, محافظة ديالى من الشرق, محافظة الأنبار من الغرب,</span></p><p dir='rtl' style='text-align:justify'>&nbsp;</p><p dir='rtl' style='text-align:justify'><span style='color:#f39c12'><span style='font-size:22px'>&nbsp; سامراء في غابر الأزمان &nbsp;</span></span></p><p dir='rtl' style='text-align:justify'>&nbsp;</p><p dir='rtl' style='text-align:justify'><span style='font-size:18px'>1- سامراء في عصر ما قبل التأريخ&nbsp; كانت مدينة &laquo;أربيل&raquo; الحالية المعروفة في التاريخ الإسلامي بإربل وفي التاريخ الآشوري بأربيلا تُعدّ أقدم بلدة مسكونة في عصرنا هذا سواء في العراق أو في العالم، لاستمرار السكن فيها من العصر الآشوري إلى اليوم وبعده، ثمّ ظهر أن سامرا هي الأقدم منها، فقد أثبتت التنقيبات الآثرية في أطلالها أن موضعها كان آهلاً منذ أدوار ما قبل التاريخ.&nbsp; وقد كشف الأستاذ الآثاري الألماني هرزفيلد فيها عن مقبرة من تلك الأدوار، بين السنّ الصخري وآثار العصر العباسي على نحو من ميل واحد من جنوب دار (الخليفة)، أي دار العامة القائمة الأواوين الثلاثة، وعثر على نوع من الفخار المصبوغ أطلق عليها اسم (فخار سامرا) وهو يمثل دوراً من أدوار ما قبل التاريخ المشار إليه آنفاً، وقد سمي (دور ثقافة سامرا) إضافة له إلى الموضع الأثري الذي كشف فيه عن هذا الفخار أول مرة، ثمّ عثرت مديرية الآثار العراقية على موضعين آخرين في سامراء، يرتقي عصورهما إلى ذلك الزمن، أحدهما في شمالي المقبرة المتقدم ذكرها، والآخر في جنوبي سامرا على ضفة دجلة فوق صدر القائم ويسمّى تل صوان، وقد جاء اسم هذا الموضع في الكتابات الآشورية بصورة (سُرمارتا Su - Ur - Mar - Ta)، وكان لهذا الموضع في أيّام الاحتلال الفارسي للعراق شأن كبير في محاربتهم الرومان خاصّة، ولقربهِ من النهر المعروف بالقاطول الكسروي أي القناة الكسروية.&nbsp;</span></p><p dir='rtl' style='text-align:justify'><span style='font-size:18px'>2- سامراء في عصر ما بعد التأريخ&nbsp; كان يطلق في فترة ما على سامراء اسم &laquo;الطَّيرهان&raquo; ، وقد ذكر ماري بن سليمان مؤرخ كرسي البطاركة ما يفيد أن هذا الاسم كان معروفاً لسامراء قبل 393 سنة من تاريخ الأسكندر المقدوني وهي السنة التي توفي فيها مار ماري السليح. فالتسمية قديمة قد ترتقي إلى العصر الآرامي وعصر الاحتلال اليوناني للعراق، واستمرت إلى أواخر القرن السابع للهجرة ولعلها بقيت إلى أكثر منه، إلاَّ أنَّ اسمها مذكور في الكتب النصرانية أكثر مما في الكتب الإسلاميّة، كما سنبين، وطيرهان في صورته اللفظية أقرب إلى اللغة الفارسية منه إلى اللغات الساميّة، بالضد من سامرا التي تنتمي للغات العراقية القديمة، وهي اسم المنطقة السابق على (طيرهان).&nbsp; فكانت منطقة سامراء تعرف في أيام الاحتلال الساساني للعراق باسم &laquo;الطَّيرهان&raquo;، قال أحمد بن أبي يعقوب: كانت سُرّ مَن رأى في متقدم الأيام، صحراء من أرض الطَّيرهان لا عمارة بها (وحقيقة الأمر أن كلمة صحراء مخالفة للواقع لأن أرضها زراعية خصبة تقع على دجلة ويحيطها الماء من ثلاث جهات فيما يشبه شبه جزيرة )، وكان بها دَير للنصارى بالموضع الذي صارت فيه دار للسلطان المعروفة بدار العامة، وصار الدير بيت المال.&nbsp; وقال أبو الحسن المسعودي في ذكر موضع سامرا: وهو في بلاد كورة الطَّيرهان.&nbsp; وقال أيضاً: فانتهى المعتصم إلى موضع سامرا وكان هناك للنصارى دير عاديّ، فسأل بعض أهل الدير عن اسم الموضع، فقال: يعرف بسامرا.&nbsp; قال له المعتصم: وما معنى سامرا؟&nbsp; قال: نجدها في الكتب السالفة والأمم الماضية أنّها مدينة سام بن نوح.&nbsp; فقال له المعتصم: ومن أي البلاد هي وإلامَ تُضاف؟&nbsp; قال: من بلاد طيرهان، إليها تضاف. ويستفاد من وصف ابن سراخيون للنهر الإسحاقي، أن الطَّيرهان كانت تشمل الجانب الغربي من هذه البقعة، فقد ذكر أن الإسحاقي كان يمر بطيرهان حتّى يجيء إلى قصر المعتصم &laquo;ص 18، 19&raquo;.&nbsp; وذكرها ابن خُرداذبه قال: تكريت... والطَّيرهان والسنّ والحديثة... قال ذلك في كتَّه كور الموصل.&nbsp; وقال قدامة: وإذ قد أتينا على أعمال المشرق فلنرجع إلى أعمال المغرب، فأولها حدّ الفرات تكريت والطَّيرهان والسنّ والبوازيج وارتفاعها على أوسط العبَر سبع مائة ألف ألف درهم. وكرّر ذلك في كتابه.&nbsp;وهذه المنطقة كانت مشهورة منذ أواخر القرن الأول للهجرة على عهد الوليد بن عبد الملك، ومن بعده فقد جاء في أخبار الجاثليق النسطوري (صليبا زخا) أنه كان من أهل الطَّيرهان وتعلّم بالمدائن وأنه نصب فشيون الباجرمي أسقفاً على الطَّيرهان. وبقي هذا الاسم مستعملاً بعد ذلك بدلالة أن الجاثليق النسطوري سرجيس رتب قيّوماً تلميذه أسقفاً بالطَّيرهان وفي أيامه قُتل المتوكل على الله العباسي، وكان إيشوعَزْخا أسقفاً على الطَّيرهان في خلافة المعتمد على الله العباسي، وفي الربع الأول من القرن الخامس للهجرة كان إيليا الأول أسقفاً على الطَّيرهان، وفي أيام القائم بأمر الله العباسي كان مكيخا بن سليمان القنكاني أسقفاً على الطَّيرهان، وكان نرسي أسقف هذه المنطقة في بعض عهد الناصر لدين الله العباسي (575 ـ 622 هـ). وقرَضَ المغولُ الدولة العباسية سنة 656هـ، وكان عمانوئيل أسقفاً على الطَّيرهان بعد هذا التاريخ. وفي بعض عهد الملك أباقاخان ابن هولاكو (663 ـ 680 هـ) كان بريخيشوع مطرانها.&nbsp;</span></p><p dir='rtl' style='text-align:justify'>&nbsp;</p><p dir='rtl' style='text-align:justify'><span style='color:#f39c12'><span style='font-size:22px'>&nbsp; تأسيس سامراء العاصمة &nbsp;</span></span></p><p dir='rtl' style='text-align:justify'>&nbsp;</p><p dir='rtl' style='text-align:justify'><span style='font-size:18px'>كما هو معلوم فإن الديار تُقام على ضفاف الأنهار لتسهيل أسباب العيش من جهة بالنسبة للمجتمعات الزراعية قديماً، ولإمكانية استغلال الأنهار لتجارة نقل البضائع من مدينة لأخرى من جهة ثانية.&nbsp; فقد شيدت المدينة على مكان كان مستوطنا عراقياً منذ قديم الزمان، وكان لسكانه نصيب من الحضارة تمتد إلى عصور سحيقة، بل يعتقد بعض المؤرخين أن سامراء هي المنطقة التي جاء منه السومريون الذين أسسوا أول حضارة بشرية في جنوب العراق كانت الأساس لما بعدها من الحخضارات العراقية وحضارات بلدان العالم القديم الأخرى. وقد أعيد بناء هذه المدينة بشكل جديد وأطلق عليها اسم (سر من رأى) اشتقاقاً من اسمها القديم كما يبدو في تحليل اسمها، أو لأن بانيها أرادها أن تكون كذلك، بسبب جمال ووسع بنائها &nbsp;الذي أراده ان يسر الناظرين، فجُعل لها الإسم حين بُنيت من جديد. وعلى أي الفرضين فإن اسمها القديم قد رجع إليها والذي بقي حتى اليوم، وهذا خلاف من يقول بأن اسمها هذا مشتق من (سر من رأى). بنيت سامراء لتكون عاصمة الإمبراطورية العباسية وذلك بعهد الحاكم العباسي المعتصم بن هارون الرشيد سنة (221هـ / 836 م) وهو ثامن (خلفاء) بني العباس ليجعلها عاصمة جديدة، ثمّ وسعها ابنه الواثق، وأوصلها إلى أقصى اتساعها المتوكل. حيث إنه وبعد وفاة المأمون بن هارون الرشيد تولى أمر الحكم الامبراطوري العباسي أخوه أبو أسحق محمد الملقب بالمعتصم سنة (218هـ 833م) وكان الأخير قد فقد الثقة بأبناء العراق ليوالوه بسبب ظلمه وميل أغلبهم أصلاً للخلفاء الشرعيين لآل البيت عليهم السلام، فأكثر من شراء الأتراك ليشكلوا جيشه خوفاً من انقلاب العراقيين وباقي العرب ضده لو كانوا يشكلون جيشه، حتى وصل عدد جنوده من الأتراك زهاء (70) ألف مملوك، وكان هؤلاء الجنود الأتراك إذا امتطوا الدواب ركضوا بها فيصدمون الناس بصورة عشوائية حتى سأمهم العراقيون الذين شجعوا الغوغاء على قتل بعضهم فتذهب دمائهم هدراً، فثقل ذلك على نفسية الحاكم المعتصم، وقرر نقل عاصمته وجنوده الأتراك لعدة أماكن خارج بغداد. فراح المعتصم يفتش عن موضع لبناء عاصمته الجديدة، فلما كان يتحرى المواضع، وصل إلى موضع يبعد عن بغداد 118 كم، وجد فيه ديرا للمسيحيين، فأقام فيه ثلاثة أيام ليتأكد له ملاءمة المحل، فاستحسنه واستطاب هواءه، واشترى أرض الدير بأربعة آلاف دينار، وأخذ في سنة ( 221 هـ ) بتخطيط مدينته التي سماها (سر من رأى) في ذلك الموضع، وذكر مصدر تأريخي أن المعتصم لما استقرت به الرغبة لاختيار موقع مدينة سامراء التي لم يكن فيها سوى ذلك الدير للنصارى، سأل الرهبان فيه عن اسم الموضع الذي هم فيه، فقال له بعض الرهبان: (نجد في كتبنا القديمة أن هذا الموضع يسمى سُرَّ من رأى وأنه كان في مدينة سام بن نوح وأنه سيعمر بعد دهور على يد ملك... فقال: أنا والله أبنيها وأنزلها وينزلها ولدي) وهكذا أمر المعتصم ببناء القصور والدور وجلب للمدينة الجديدة أصناف الشجر المثمر من جميع البلدان فغرست البساتين في كل مكان. وأشارت بعض المصادر التاريخية بأن المعتصم بعدما وقع اختياره برغبة شديدة على موقع سامراء وبناها، أمَر بأن يستقر الأتراك من مماليكه (عسكره وقادتهم) في أماكن خاصة من المدينة، وأمر أن لا يختلطوا بعناصر من مواطني دولته الآخرين فيها كي لا تفسد طاعتهم له، ولم تمضي زهاء ثلاث سنوات حتى قصدها الناس وشيدوا فيها مباني شاهقة وسميت بالعسكر والنسبة اليها عسكري، فأصبحت سامراء من المدن المهمة في عهد بني العباس وكان من ضمن العمران فيها أن شيد المعتصم ثكنات عسكرية لسكن (250) ألف جندي واصطبلات تستوعب (160) ألف حصان. ولا تُعرف مدينة اتسع عمرانها في بضع سنوات كما اتسع عمران مدينة سامراء، حتّى امتد العمران إلى مسافة (35) كيلومتراً على ضفتي نهر دجلة.&nbsp;</span></p><p dir='rtl' style='text-align:justify'>&nbsp;</p><p dir='rtl' style='text-align:justify'><span style='font-size:18px'>&nbsp;</span><span style='color:#f39c12'><span style='font-size:22px'> أفول نجم سامراء العاصمة &nbsp;</span></span></p><p dir='rtl' style='text-align:justify'>&nbsp;</p><p dir='rtl' style='text-align:justify'><span style='font-size:18px'>لما توفى مؤسس مدينة سامراء - العاصمة العباسية آنذاك - المعتصم سنة 227هـ، فقد تولى الحكم ولده هارون الواثق الذي توفى سنة 232هـ، فارتقى الحكم المتوكل بن المعتصم الذي كان من أشد حكام سامراء العباسيين ظلما على المسلمين من أتباع أهل البيت عليهم السلام حيث &nbsp;أمر سنة 236هـ بهدم قبر الإمام الحسين بن علي عليهما السلام في كربلاء وسط العراق، وهدم ما يحيطه من منازل وأبنية، ومنع الناس من زيارته كيلا يستلهموا من مرقده قيم الثورة التي طالما زرعها في نفوس الثائرين على الظلم في كل زمان ومكان، والمتوكل وأجداده وآبائه من الحكام كانوا من أشد الظلمة والجبابرة، فحاربوا رموز أضرحة آئمة الهدى وخلفاء النبي صلى الله عليه وآله، وهم الأحق - بنص الله عليهم &ndash; بالخلافة ممن تقلدوها ممن يدعون الإسلام زوراً وبهتاناً، فكان ظلمه سبباً رئيسياً في قتله من قبل ابنه الذي تولى الحكم من بعده. وهكذا تولى بعد المتوكل إبنه المنتصر ومن بعده تولى المستعين، والمعتزّ الذي كثرت في عصره الاضطرابات في سامراء سنة 253هـ ووافق أن استشهد الإمام علي الهادي عليه السلام على أيدي حكام بني العباس بسامراء وكان ذلك في 27جمادي الآخر سنة 254هـ، ولامتصاص نقمة الناس بعث المعتز بأخيه ابن أحمد المتوكل فصلى عليه في الشارع المعروف باسم شارع أبي أحمد، وهو من شوارع سامراء الرئيسية آنذاك، فلما كثر عدد الناس المشاركون في تشييع الإمام الهادي عليه السلام، وكثر بكاؤهم الشديد على مفارقته، ولتجنب انقلاب الناس على الحكم العباسي الغاشم، أصدر المعتز أمراً برد النعش إلى دار الإمام، فدفن فيه، وهو حالياً موقع مبنى العتبة العسكرية المقدسة التي تضم مرقدي الإمامين علي الهادي والحسن العسكري (عليهما والسلام ) وباقي أرحامهما من أهل البيت عليهم السلام. ثم ملك بعد المعتزّ، والمهتدي، وبعده المعتمد، حيث أنّ المدينة تركت بعد ذلك في عهده وأعاد مقر الحكم الإمبراطوري العباسي (المتسمي ظاهراً وزوراً وبهتاناً بالخلافة) إلى بغداد، ولم يكن قد مرّ على سامراء إلاّ أربع وخمسون سنة مَلَك خلالها ثمانية من أباطرة بني العباس (ما يسمى كذباً بالخلفاء) وهم: المعتصم، والواثق، والمتوكّل، والمنتصر، المستعين، والمعتزّ، والمهتدي، والمعتمد.</span></p><p dir='rtl' style='text-align:justify'>&nbsp;</p><p dir='rtl' style='text-align:justify'><span style='color:#f39c12'><span style='font-size:22px'>&nbsp; وصف سامراء في العصر الحديث &nbsp;</span></span></p><p dir='rtl' style='text-align:justify'>&nbsp;</p><p dir='rtl' style='text-align:justify'><span style='font-size:18px'>معالمها الأثرية&nbsp; كان يحيط بالمدينة سور مضلع على شكل يميل إلى الاستدارة، يبلغ طول محيطه 2 كم، ولايتجاوز قطره 680 م، مبني بالجص والآجر يصل ارتفاعه إلى 7 م، وكان له 19 برجا وأربعة ابواب، هي باب القاطول، وباب الناصرية، وباب الملطوش، وباب بغداد، وظل هذا السور ماثلا للعيان حتى سنة (1356هـ / 1936 م) .&nbsp; كانت تنتشر في أرجاء المدينة الحدائق العامة والخاصة، وفتح فيها في العقود الأخيرة متحف وضعت فيه المخطوطات والمصورات المهمة عن اثارها، وفي مدخل المدينة يقع مشروع الثرثار الذي يقي بغداد من الغرق، ومن معالمها الأثرية :&nbsp; المئذنة الملوية، والنافورة، قصر بلكوارا (شيده المعتز سنة 247هـ)، قصر العاشق والمعشوق (شيده المعتمد العباسي سنة 264هـ)، قصر المعتصم (الجوسق الخاقاني)، قصر المختار، القصر الوزيري، قصر العروس، القصر الجعفري، مدينة المتوكلية (على بعد 15 كم شمال مدينة سامراء)، قصر الجص، بركة السباع، القبة الصليبية، دار العامة، تل الصوان، وسور سامراء.&nbsp; محلاتها وأحيائها&nbsp; العابد، البوجول، البوبدري، البونيسان، والمحلة الغربية، القاطول، القلعة، والمحلة الشرقية، وقد بدأ اتساع المدينة في العصر الحديث ليشمل عدة أحياء سكنية من ضمنها حي الضباط وحي الجبيرية وحي العرموشية وحي القادسية وحي المعلمين ولازال اتساع رقعة البناء قائما الى يومنا هذا.&nbsp; شوارعها&nbsp; شارع الخليج ، وشارع السريحة ( يعرف بشارع الاعظم ) ، وشارع الحير الاول ، وشارع أبي أحمد بن الرشيد ، وشارع برغمش التركي..&nbsp; مساجدها&nbsp; جامع سامراء الكبير الذي شيده المعتصم عند بداية بناء المدينة سنة ( 221 هـ). المسجد الجامع لمدينة المتوكلية سنة 245 هـ والذي بناه الحاكم العباسي المتوكل وشيد ومئذنته الشهيرة ( الملوية ) الكبرى. جامع أبي دلف بملويته الثانية الذي يبعد نحو 15 كم عن شمال المدينة، وكلا الجامعين يعدان من الآثار العباسية المهمة في المدينة. جامع القلعة، مسجد حسن باشا، مسجد حميد الحسون، مسجد سيد درويش، مسجد البورحمان، مسجد علي بن أبي طالب عليه السلام، مسجد الحاج صالح الرحماني، ومسجد الأرقم، مسجد أولاد الحسن عليه السلام، جامع الفاروق.</span></p><p dir='rtl' style='text-align:justify'>&nbsp;</p><p dir='rtl' style='text-align:justify'><span style='color:#f39c12'><span style='font-size:22px'>&nbsp; مراقدها ومقاماتها &nbsp;</span></span></p><p dir='rtl' style='text-align:justify'>&nbsp;</p><p dir='rtl' style='text-align:justify'><span style='font-size:18px'>يعتبر مشهد الامامين علي الهادي والحسن العسكري عليهما السلام، أهم معالم مدينة سامراء، ويضم أيضاً مرقد السيدة نرجس زوج الإمام الحسن العسكري عليها السلام ( ت سنة260 هـ) ، وقبر السيدة حكيمة بنت الإمام الجواد عليه السلام ( ت سنة 260 هـ).&nbsp; قبة سرداب الغيبة الواقعة فوق سرداب بيت الأئمة الثلاثة علي الهادي والحسن العسكري ولحجة بن الحسن عليهم السلام. وتتبع لمدينة سامراء مدن أصغر منها وقرى تضم العديد من مراقد أهل البيت وأصحابهم عليهم السلام، وهي: مرقد السيد محمد بن الإمام علي الهادي عليه السلام ( ت سنة 252 هـ ) ( 261 هـ). مرقد الإمام محمد الدري الذي ينتهي نسبه إلى الإمام الكاظم عليه السلام ( ت سنة 300 هـ). مرقد بنات الكاظم عليهم السلام في ناحية الدجيل. مرقد بنات الحسن عليهم السلام في منطقة الجلام. مرقد آمنة بنت الإمام الحسن عليه السلام. مرقد إبراهيم بن مالك الإشتر النخعي رضي الله عنهما. مرقد الشيخ محمد الجاجيري ( ت سنة 590 هـ). مرقد الشيخ كمر بن هلال ( ت سنة 1200 هـ). مرقد أحمد الدنبلي الخوئي ( سلطان خوي ) ( ت سنة 1200 هـ). مرقد محمود الطهراني ( ت سنة 1304 هـ). مرقد مهدي الشيرازي ( ت سنة 1308 هـ). مرقد إبراهيم النوري ( ت سنة 1320 هـ). مرقد محسن الزنجاني ( ت سنة 1321 هـ).</span></p><p dir='rtl' style='text-align:justify'><span style='font-size:18px'>خزائنها ومكتباتها&nbsp; خزانة محمد بن عبدالملك الزيات، خزانة الفتح بن خاقان، الخزانة الكندية، خزانة علي بن يحيى المنجم، مكتبة العسكريين العامة، مكتبة الإمام محمد المهدي، مكتبة سامراء العامة، مكتبة ابن بطوطة، مخطوطات المكتبة العسكرية العامة في مدرسة الإمام الشيرازي ( قدس سره ).&nbsp;</span></p><p dir='rtl' style='text-align:justify'><span style='font-size:18px'>احتل الفرس هذه المنطقة في القرون التالية لميلاد نبي الله عيسى المسيح عليه السلام، واتخذوا من موقع سامراء الحصين مركزا استراتيجيا وعسكريا أثناء قتالهم الروم، وقد أقاموا فيها الحصن المعروف باسم حصن سومير، الذي جاء ذكره مع تراجع الجيوش الرومية ، بعد مقتل جوليان سنة 363 م. قام الحاكم العباسي هارون الرشيد بحفر أول نهر في المدينة وشيد قصراً له سمي باسمه، وأراد أن يبني مدينة في منطقة القاطول في سامراء لكنه لم يتمها. ( 198 ـ 218 هـ ): في عهد الحاكم العباسي المأمون بنيت قرية المطيرة والتي كانت من منتزهات بغداد وسامراء. سنة 221هـ: أسس المعتصم مدينة سامراء عاصمة امبراطوريتهم التي يُطلق عليه الدولة العباسية. من سنة (221 هـ ) إلى سنة ( 279 هـ ): جعل ستة حكام عباسيين (يسمون أنفسهم خلفاء) بعد المعتصم مدينة سامراء عاصمة لهم، هم المتوكل والمنتصر &nbsp;والمستعين والمعتز والمهتدي والمعتمد، وظلت مقرا للحكم (للخلافة) العباسي فترة تقرب من 58 عاماً. سنة ( 223 هـ ): وصل الافشين ( القائد العسكري للمعتصم ) مدينة سامراء ومعه بابك وأخوه اسيرين.&nbsp; سنة 245 هـ بنى الحاكم العباسي المتوكل مدينة المتوكلية وشيد المسجد الجامع ومئذنته الشهيرة ( الملوية ) . سنة ( 247 هـ ): اغتيل المتوكل وتولى الحكم من بعده المنتصر، فانتقل إلى سامراء، وأمر الناس جميعا بالانتقال إلى الماحوزة، وأن يهدموا المنازل ويحملوا النقض إلى سامراء، وخربت قصور الجعفري ومنازله ومساكنه وأسواقه. سنة ( 254 هـ ): توفي الامام علي الهادي عليه السلام ودفن في داره. 15 شعبان المعظم سنة ( 255 هـ ): مولد خاتم الوصيين وآخر الخلفاء الشرعيين الإثني عشر للنبي محمد صلى الله عليه وآله، الإمام محمد المهدي الحجة بن الحسن العسكري عليهم السلام في دار أبيه وجده في سامراء. سنة (255هـ): بنى المتوكل لنفسه مدينة المتوكلية، واتخذها موقعا له ولأتباعه قرب سامراء حتى كادت الأخيرة تخلو من أهلها. ( بعد سنتي 254 هـ وسنة 260 هـ ): ولما استشهد الامامان علي الهادي والحسن العسكري عليهما السلام، اتخذ مرقداهما ومراقد عائلتهما المدفونون جميعاً في دارهم، مزاراً بنيت حوله العمارات وانشئت الدور والمنازل العامة فحافظت المدينة على عمرانها الى ما بعد انتهاء الدولة العباسية. سنة ( 333 هـ ): وسع ناصر الدولة الحمداني المدينة وأحاطها بسور. سنة ( 260 هـ ): سجنت سراري الامام الحسن العسكري عليه السلام وفي السنة نفسها توفي عليه السلام ودفن الى جوار ابيه عليه السلام. سنة ( 279 هـ ): ترك المعتمد المدينة ليتخذ من بغداد مستقرا وعاصمة له، قبل ستة أشهر من وفاته سنة ( 279 هـ )، وبعد أن رجوع الحكام (الخلفاء) العباسيون إلى بغداد ورجوعها عاصمة لهم، هجرت مدينة سامراء وأذن ذلك بخرابها. سنة ( 445 هـ ): وقعت حرب البساسيري والسلجوقيين في المدينة. سنة ( 1286 هـ / 1869 م ): أصدر والي بغداد مدحت باشا أمرا بجعل سامراء قضاءً تابعاً إلى بغداد، وكان أول قائم مقام لها هو علي بك.&nbsp; سنة ( 1296 هـ / 1879 م ): هاجم الهماوند ( جماعة من الاكراد ) مدينة سامراء ونهبوها. في سنة ( 1318 هـ ): صدرت من سامراء فتوى أطاحت بالمصالح الأجنبية المستغلة للشعوب المقهورة تحت إرادتها، حيث حاولت الشركات البريطانية احتكار زراعة وبيع التنباك في إيران، فتصدى زعيم الطائفة آنذاك باعتبار مسؤوليته عن أمن ومصلحة الأمة الإسلامية للأمر، وكان مقره في سامراء في العراق، وهو المرجع الديني آية الله العظمى الميرزا محمد حسن الشيرازي، وأصدر فتواه الشهيرة بتحريم بيع التنباك، فانهار اقتصاد تلك الشركات مما اضطر ملك إيران آنذاك إلى إلغاء الامتيازات، وتمت بذلك حماية مصالح المسلمين في ذلك البلد. سنة ( 1335 هـ / 1917 م ): احتل الانكليز مدينة سامراء إبان الحرب العالمية الاولى. سنة ( 1335 هـ ): صعد بعض السراق إلى مشهد الامامين علي الهادي والحسن العسكري عليهما السلام، وقلعوا 25 طابوقة مغلفة بالذهب من القبة الشريفة للمشهد. سنة ( 1343 هـ / 1924 م ): حدث وباء الكوليرا في المدينة، وكثرت الإصابات وارتفعت الوفيات، وهرب أغلب الاهالي منها. سنة ( 1920 م ): امتدت ثورة العشرين العراقية الكبرى ضد الاحتلال البريطاني الغاشم، إلى مدينة سامراء وشارك أهلها فيها مع أهلهم في سائر مناطق العراق.&nbsp; سنة ( 1359 هـ / 1941 م ): ثارت ثائرة أهالي سامراء ضد الجيش الانكليزي، عندما أخبرهم متصرف بغداد آنذاك بأن الانكليز يريدون احتلال محطة قطار سامراء، وقطع سكة الحديد في جنوب المدينة، وذلك في عهد حكومة رشيد عالي الكيلاني في 23 / مايس / 1941 م في عهد وصاية الأمير عبد الإله على ابن اخته الملك فيصل الثاني ملك العراق آنذاك. سنة ( 1250 هـ ): عمر الشيخ زين العابدين السلماني سور المدينة، وانفق على تعميره احد ملوك الهند. سنة ( 1258 هـ ): أعاد الملك أمجد علي شاه بناء سور المدينة وتعميره . سنة ( 1294 هـ / 1878 م ): أيام الدولة العثمانية نصب أول جسر على نهر دجلة يربط مدينة سامراء بالضفة الاخرى له.&nbsp; سنة ( 1258 هـ ) أعاد الملك أمجد علي شاه بناء سور المدينة وتعميره بواسطة السيد إبراهيم بن السيد باقر القزويني.&nbsp; أواسط القرن الثالث عشر الهجري: قام الميرزا محمد حسن الشيرازي بعدة أعمال في المدينة وجعلها مركزاً علمياً مرموقاً إذ بنى مدرسة علمية كبيرة لازالت باقية إلى اليوم.&nbsp; سنة ( 1952 م ): بوشر العمل بتنفيذ مشروع الثرثار الذي يعتبر من أهم المشاريع الاروائية في المدينة.&nbsp; سنة ( 1375 هـ / 1955 م ): أمرت الحكومة العراقية أيام حكم الملك فيصل الثاني بشق شارع يمتد من باب القاطول حتى باب العتبة العسكرية المقدسة، بعد تهديم الباب المذكور، وبنى صرحاً لها ودوراً للبلدية ومستشفى ومدرسة ودائرة للبرق والبريد. سنة ( 1299 هـ / 1881 م ): بنيت أول مدرسة ابتدائية في مدينة سامراء. سنة 1976م: الحقت المدينة كمركز قضاء تابع لمحافظة صلاح الدين بعد ان كانت تابعة بمعظم مدن هذه المحافظة الى محافظة بغداد.&nbsp; الأسبوع الأخير من شهر كانون الأول 2005م: صدور قانون إدارة العتبات المقدسة والمزارات الشيعية الشريفة ذي الرقم 19 لسنة 2005م من الجمعية الوطنية المنتخبة، والمستند إلى الدستور العراقي المصادق على شرعيته شعبياً في 15/10/2005م، والذي أرجع إدارة العتبة العسكرية المقدسة إلى ديوان الوقف الشيعي العراقي بعد أن كان تابعاً للوقف السني العراقي، الذين تشكلا بعد حل وزارة الأوقاف والشؤون الدينية العراقية، بعد أشهر من سقوط اللانظام الديكتاتوري في 9/4/2003م، ولكن للأسف لم تقبل إدارة الوقف السني الموقرة تنفيذ القانون وتسليم العتبة المقدسة إلى إدارة الوقف الشيعي.&nbsp; 22/2/2006م قام أزلام النظام السابق يعاونهم شُذاذ الآفاق من تنظيم القاعدة من خارج العراق بتنفيذ أكبر جريمة في تأريخ سامراء بعد قتل أئمتها علي الهادي والحسن العسكري عليهما السلام، ألا وهي فاجعة تفجير حرم مرقدهما وقبته الشريفة، والذي يُعد أكبر انتهاك لحرمتهما بعد شهادتهما، وهو خسارة كبيرة أيضاً لأهالي سامراء الكرام خصوصاً وللعراقيين عموماً، بهذا المصاب الجلل وفقدانهم أيضاً بناءٌ أثري يُعد الأقدم من بين عتبات العراق المقدسة بعمر يزيد على ألف سنة، وقد حصل التفجير بسبب سوء الوضع الأمني في المدينة وقلة حرس العتبة المعينين من قبل ديوان الوقف السني الموقر والبالغين خمسة أشخاص فقط، وسيطرة تنظيم القاعدة الإرهابي على المدينة. حزيران 2007م قام أزلام النظام السابق يعاونهم شُذاذ الآفاق من تنظيم القاعدة من خارج العراق بإكمال جريمتهم &nbsp;في الفاجعة السابقة، فهدّموا مئذنتي العتبة العسكرية المقدسة. نيسان 2008م بدء رحلة النصرة التي قام بها منتسبي العتبتين المقدستين الحسينية والعباسية بمعاونة (اللجنة الفنية لإعمار الروضة العسكرية الشريف) المعينة من رئاسة الوزراء العراقية، حيث تم رفع أنقاض الفاجعتين خلال 14 يوماً فقط بعد عجز الشركة التركية التي كانت الحكومة العراقية قد كلفتها بالإعمار عن رفع الأنقاض خلال عدة أشهر، وعلى إثر ذلك ألغى رئيس الوزراء العراقي آنذاك نوري كامل المالكي، عقد الشركة، وأوكل الأمر إلى اللجنة الفنية المذكورة. 17 نيسان 2009م &nbsp;(اللجنة الفنية لإعمار الروضة العسكرية الشريف) تنجز بناء حرم وقبة وهيكل منارتي مرقد الإمامين العسكريين عليهما السلام في 11 شهراً وبأيدي العراقيين فقط، بعد عجز الشركة التركية المذكورة عن الإعمار. 2010م &nbsp;البدء بإتوسيع حرم العسكريين عليهما السلام بنسبة 100% كمساحة أفقية، و200% كمجموع مساحة عمودية، إذ يتكون الحرم الجديد من طابقين.</span></p>",
   "en": "<h1 style='text-align:justify'><span style='font-size:48px'><span style='color:#f39c12'>Samara in history and language</span></span></h1><p style='text-align:justify'>&nbsp;</p><p style='text-align:justify'><img alt='' src='https://www.atlastours.net/iraq/alaskareyya_shrine.jpg' style='height:349px; width:560px' /><span style='display:none'>&nbsp;</span></p><p><span style='font-size:20px'>The origin of the name (Samarra) goes back to the rest of the Aramaic names in Iraq that used to end with the missing letter Alif, such as (Karbala) (Baquba). And (Karbala) and they became (Samarra and Karbala), while the letter &ldquo;alif&rdquo; was replaced by the letter &ldquo;taa&rdquo; from the name of the city of Baquba, and it became written (Baquba). He was pleased with those who saw it) before the letters of that name were combined with the form (Samarra). The discovery of the city of Samarra goes back to ancient times. It was mentioned by the Roman historian Amiens Marcalis (320-390 AD) in the form (sumera), and the Greek historian Zosimus noted it in the form of soma. The Assyrian being (Shumra) and all this was done before it was built again by the Abbasid ruler Al-Mu&#39;tasim.</span></p><p><span style='font-size:20px'>Geographical location The city is located on the eastern bank of the Tigris River, about 118 km north of the capital, Baghdad, at a longitude of 43 degrees and 45 minutes, and at a latitude of 34 degrees and 35 minutes. The modern Iraqi state in 1920 AD, following the Great Iraqi Revolution of the Twenty, and was affiliated to the districts of (Tikrit, Balad, Dujail), and the previous regime created Salah al-Din Governorate in the early seventies, to include all the cities of Samarra district and other cities and villages from the governorates of Kirkuk and Nineveh, and instead of He made Samarra the center of the new governorate, expanded the Tikrit sub-district and made it a district and then the center of the new governorate, to which the city of Samarra was affiliated. From the north and northwest, Baghdad Governorate from the south, Diyala Governorate from the east, Anbar Governorate from the west,</span></p><p><span style='color:#e67e22'><span style='font-size:20px'>Samarra in ancient times</span></span></p><p><span style='font-size:20px'>1- Samarra in the prehistoric era The present city of &ldquo;Erbil&rdquo;, known in Islamic history in Erbil and in the Assyrian history in Erbil, was considered the oldest inhabited town in our time, whether in Iraq or in the world, due to the continuity of housing in it from the Assyrian era until today and after, then it appeared that Samara is the oldest of them, as archaeological excavations in its ruins have proven that its place was inhabited since prehistoric times. The German archaeological professor Herzfeld revealed in it a tomb of those floors, between the rocky tooth and the traces of the Abbasid era, about one mile south of the house (the Caliph), that is, the general house of the three Iwans, and a type of painted pottery was found called (Samra Pottery). It represents one of the prehistoric roles referred to above, and it was called (the role of Samara culture) in addition to the archaeological site in which this pottery was first revealed. One of them is in the north of the aforementioned cemetery, and the other is in the south of Samaria on the bank of the Tigris above the chest of the Qaim and is called Tal Sawan, and the name of this place came in the Assyrian writings with a picture (Su - Ur - Mar - Ta), and this place was during the days of the Persian occupation of Iraq A great importance in fighting the Romans in particular, and because of its proximity to the river known as the Kasruri Kasrwy, meaning the Kasrawy Canal.</span></p><p><span style='font-size:20px'>2- Samarra in the post-historical era. At one time, Samarra was called &ldquo;the fly.&rdquo; Marie bin Suleiman, historian of the Patriarchs&rsquo; Chair mentioned what indicates that this name was known to Samarra 393 years before the history of Alexander the Great, the year in which Saint Mary died. Saleeh. The name is old and may go back to the Aramaic era and the era of the Greek occupation of Iraq, and it continued until the end of the seventh century of migration and may have survived to more than it, but its name is mentioned in the Christian books more than in the Islamic books, as we will show, and Tirhan in its verbal form is closer to the Persian language than to the Semitic languages, in contrast to Samara, which belongs to the ancient Iraqi languages, which is the name of the region prior to (Tirhan). The Samarra region was known during the days of the Sassanid occupation of Iraq as &ldquo;the tirahan.&rdquo; Ahmad ibn Abi Yaqoub said: It was the secret of those who saw in the early days, a desert from the land of the tirahan with no architecture (the truth of the matter is that the word desert is contrary to reality because its fertile agricultural land lies on the Tigris It is surrounded by water on three sides in what looks like a peninsula), and there was a monastery for the Christians in the place where it became a home for the Sultan, known as the House of Commons, and the monastery became the house of money. Abu al-Hasan al-Masudi said in mentioning the location of Samarah: It is in the country of the country of the Air. He also said: So Al-Mu&#39;tasim went to the place of Samarah, and there was an ordinary monastery for the Christians. Some of the people of the monastery asked about the name of the place, and he said: It is known as Samara. Al-Mu&#39;tasim said to him: What is the meaning of Samara? He said: We find it in the previous books and the past nations that it is the city of Shem, son of Noah. Al-Mu&#39;tasim said to him: From which country is it and to what is it added? He said: From the country of flight, to it is added. It is understood from Ibn Sarakhyun&rsquo;s description of the Al-Ishaqi River, that the flight included the western side of this spot. It was mentioned by Ibn Khordadhbih, he said: Tikrit... and Tirahan, and the Sunnah and the Hadith... He said that in Kittah Kaur of Mosul. Qudamah said: And when we have come to the works of the East, let us return to the works of the Maghreb. He repeated this in his book. This area was famous since the end of the first century of migration during the reign of Al-Walid bin Abdul-Malik, and after him it came in the news of the Nestorian Catholicos (Saliba Zakha).</span></p><p><span style='font-size:20px'>That he was one of the people of Tirhan and learned in Al-Madain and that he appointed Fashion Al-Bajrimi as bishop of Tirhan. This name remained in use after that, with the indication that the Nestorian Catholic Sergis had appointed Qayyum his student a bishop in the tirahan, and in his days the Abbasid trustee of God was killed, and Ishoazha was a bishop of the tirahan in the Abbasid caliphate, and in the first quarter of the fifth century AH, Elijah the first was bishop on the In the days of Al-Qaim Bi-Amr Allah Al-Abbasid, Makekha bin Suleiman Al-Qankani was Bishop of Al-Tirhan, and Narsi was the bishop of this region during some of the Abbasid era of Al-Nasir Li-Din Allah (575-622 AH). The Mongols loaned the Abbasid state in 656 AH, and Emmanuel was bishop of the country after this date. During the reign of King Abaqa Khan Ibn Hulagu (663 - 680 A.H.), Berekishoa was its bishop.</span></p><p><span style='color:#e67e22'><span style='font-size:20px'>The founding of the capital, Samarra</span></span></p><p><span style='font-size:20px'>As it is known, homes are built on the banks of rivers to facilitate livelihoods on the one hand for agricultural communities in the past, and for the possibility of using rivers for trade in transporting goods from one city to another on the other hand. The city was built on a place that had been an Iraqi settlement since ancient times, and its inhabitants had a share of civilization extending back to ancient times. Some historians even believe that Samarra is the area from which the Sumerians came, who founded the first human civilization in southern Iraq, which was the basis for the later Iraqi civilizations and civilizations. Other countries of the ancient world. This city was rebuilt in a new way and called it (The Secret of the One who saw) derived from its old name as it appears in the analysis of its name, or because its builder wanted it to be like that, because of the beauty and expansion of its construction, which he wanted to please the onlookers, so he made the name for it when it was built again . And on any of the two hypotheses, its old name has been returned to it, which has remained until today, and this is contrary to those who say that this name is derived from (The Secret of the One who saw). Samarra was built to be the capital of the Abbasid Empire during the reign of the Abbasid ruler Al-Mu&rsquo;tasim bin Harun Al-Rashid in the year (221 AH / 836 AD), the eighth (caliphate) of the Abbasids to make it a new capital, then his son Al-Wathiq expanded it, and brought it to its maximum extent. After the death of al-Ma&rsquo;mun ibn Harun al-Rashid, his brother Abu Ishaq Muhammad, nicknamed al-Mu&rsquo;tasim, took over the Abbasid imperial rule in the year (218 AH 833 AD). For fear that the Iraqis and the rest of the Arabs would turn against him if they formed his army, until the number of his soldiers from the Turks reached about (70) thousand Mamluks, and these Turkish soldiers, if they were riding on animals, ran with them, shocking people randomly until the Iraqis who encouraged the mobs to kill each other were tired of them, so their blood was wasted This weighed heavily on the psyche of the ruler, al-Mu&#39;tasim, and he decided to move his capital and his Turkish soldiers to several places outside Baghdad. Al-Mu&#39;tasim went looking for a place to build his new capital, and when he was investigating the locations, he arrived at a place 118 km from Baghdad, where he found a monastery for Christians, so he stayed there for three days to make sure that the shop was suitable for him. In the year 221 A.H., he planned his city, which he called &ldquo;The Secret of the One Who Saw&rdquo; in that place. A historical source mentioned that Al-Mu&rsquo;tasim, when the desire to choose the site of the city of Samarra, where there was only that monastery for the Christians, asked the monks about the name of the place they were in. Some of the monks said to him: (We find in our old books that this place is called the secret of the one who saw it, and that it was in the city of Sam, son of Noah, and that it will live in ages after the hands of a king... He said: I, by God, will build it and bring it down and bring it down to my son). The new city had varieties of fruit trees from all countries, and gardens were planted everywhere. Some historical sources indicated that al-Mu&rsquo;tasim, after he had chosen with great desire the site of Samarra and its building, ordered that the Turks of his kingdoms (his military and leaders) settle in special places in the city, and he commanded that they not mix with elements of other citizens of his state there so as not to spoil their obedience to him, and it did not go on. About three years ago, people came to it and built high-rise buildings in it, which were called the military and attributed to it a military man. Samarra became one of the important cities in the era of Bani al-Abbas, and it was among the urbanization that al-Mu&rsquo;tasim built military barracks for housing (250) thousand soldiers and stables that accommodated 160 thousand horses. A city whose urbanization expanded in a few years is not known as the city of Samarra did, until the urbanization extended to a distance of (35) kilometers on both banks of the Tigris River.</span></p><p><span style='color:#e67e22'><span style='font-size:20px'>The demise of the star of Samarra, the capital</span></span></p><p><span style='font-size:20px'>When the founder of the city of Samarra - the Abbasid capital at the time - al-Mu&#39;tasim died in the year 227 AH, his son Harun al-Wathiq, who died in the year 232 AH, took power. Al-Mutawakkil ibn al-Mu&#39;tasim, who was one of the most unjust rulers of the Abbasid Samarra against the Muslims from the followers of Ahl al-Bayt, peace be upon them, ascended the rule in the year 236 AH. By demolishing the tomb of Imam Hussein bin Ali, peace be upon both of them, in Karbala, central Iraq, demolishing the surrounding houses and buildings, and preventing people from visiting it so that they would not be inspired by the values ​​of the revolution that he had always planted in the hearts of those revolting against injustice in every time and place. The most oppressive and the tyrant, so they fought the symbols of the shrines of the Imams of guidance and the successors of the Prophet, may God&rsquo;s prayers and peace be upon him and his family. Thus, after Al-Mutawakkil, his son Al-Muntasir took over, and after him he took over the helper, and Al-Mu&rsquo;taz, who in his time arose in unrest in Samarra in the year 253 AH, and agreed that Imam Ali al-Hadi, peace be upon him, was martyred at the hands of the rulers of Bani al-Abbas in Samarra, and that was on 27 Jumada al-Akhir in the year 254 AH. Ahmed Al-Mutawakil prayed for him in the street known as Abi Ahmed Street, and he is from Shaw</span></p><p><span style='font-size:20px'>Samarra, the main city at that time, when the number of people participating in the funeral of Imam Al-Hadi, peace be upon him, and their intense crying over his separation, and to avoid the people&rsquo;s coup against the brutal Abbasid rule, Al-Moataz issued an order to return the coffin to the Imam&rsquo;s house, where he was buried in it, which is currently the site of the Holy Military Shrine building. Which includes the shrines of the two imams Ali Al-Hadi and Al-Hassan Al-Askari (peace be upon them) and the rest of their relatives from the Ahl al-Bayt, peace be upon them. Then he reigned after al-Mu&#39;tazz, al-Muhtadi, and after him al-Mu&#39;tamid, as the city was left after that during his reign and he restored the seat of the Abbasid imperial rule (which is apparently, falsely and falsely called the caliphate) to Baghdad, and it was only fifty-four years passed from Samarra during which eight of the emperors of Banu al-Abbas reigned. (The so-called caliphs falsely) They are: Al-Mu&rsquo;tasim, Al-Wathiq, Al-Mutawakkil, Al-Muntasir, Al-Mu&rsquo;tazz, Al-Mu&rsquo;tazz, Al-Muhtadi, and Al-Mu&rsquo;tamid.</span></p><p><span style='color:#e67e22'><span style='font-size:20px'>Description of Samarra in the modern era</span></span></p><p><span style='font-size:20px'>Its archaeological landmarks The city was surrounded by a polygonal wall in a shape that tends to rotate, its circumference was 2 km, and its diameter did not exceed 680 m. It was built with plaster and bricks, its height reached 7 m. It had 19 towers and four gates, namely Bab al-Qatul, Bab al-Nasiriyah, and Bab al-Maltush. and the Baghdad Gate, and this wall remained visible until the year (1356 AH / 1936 AD). Public and private gardens were spread throughout the city, and in recent decades a museum has been opened in it in which important manuscripts and photographs about its antiquities were placed. 247 AH), Al-Ashiq and Al-Ma&rsquo;shouq Palace (built by the Abbasid Mu&rsquo;tamid in 264 AH), Al-Mu&rsquo;tasim Palace (Al-Jawsaq Al-Khaqani), Al-Mukhtar Palace, Al-Waziri Palace, Al-Arous Palace, Al-Jaafari Palace, Al-Mutawakkiliya City (15 km north of Samarra), Al-Jess Palace, Birkat El-Saba&rsquo; , the Crusader Dome, the General House, Tell Al-Sawan, and the Samarra Wall. Its shops and neighborhoods are Al-Abed, Al-Bogol, Al-Boubdari, Al-Bonisan, Al-Mahalla Al-Gharbia, Al-Qatul, Al-Qala&rsquo;a, and Al-Mahalla Al-Sharqiah. The city&rsquo;s expansion began in the modern era to include several residential neighborhoods, including Al-Dhubat neighborhood, Al-Jubeiriya neighborhood, Al-Aramushiyah neighborhood, Al-Qadisiyah neighborhood, and Al-Moalim neighborhood, and the expansion of the building area still exists today. this. Its streets are Al-Khaleej Street, Al-Sariha Street (known as Al-Azam Street), Al-Hayr Al-Awal Street, Abi Ahmed Bin Al-Rasheed Street, and Al-Turki Bergmash Street.. Its mosques are the Great Samarra Mosque, which was built by Al-Mu`tasim at the beginning of the city&rsquo;s construction in the year (221 AH). The Great Mosque of Al-Mutawakkiliya in the year 245 AH, which was built by the Abbasid ruler Al-Mutawakkil and built and its famous minaret (Al-Malwiya) the Great. The Abi Dalaf Mosque in its second mall, which is about 15 km from the north of the city, and both mosques are considered important Abbasid monuments in the city. The Citadel Mosque, Hassan Pasha Mosque, Hamid Al-Hassoun Mosque, Sayed Darwish Mosque, Al-Burrahman Mosque, Ali bin Abi Talib Mosque, Peace Be Upon Him, Al-Hajj Saleh Al-Rahmani Mosque, Al-Arqam Mosque, Awlad Al-Hassan Mosque, Peace Be Upon Him, Al-Faruq Mosque.</span></p><p><span style='font-size:20px'><span style='color:#e67e22'>Shrines and shrines</span></span></p><p><span style='font-size:20px'>The shrine of Imam Ali al-Hadi and al-Hasan al-Askari, peace be upon them, is the most important landmark of the city of Samarra. It also includes the shrine of Lady Nargis, husband of Imam al-Hasan al-Askari, peace be upon her (died in year 260 AH), and the tomb of Lady Hakima, daughter of Imam al-Jawad, peace be upon him (died in year 260 AH). The dome of the basement of the occultation is located above the basement of the house of the three imams, Ali Al-Hadi, Al-Hasan Al-Askari, and Lahija bin Al-Hassan, peace be upon them. The city of Samarra has smaller cities and villages that contain many shrines of Ahl al-Bayt and their companions, peace be upon them: the shrine of Sayyid Muhammad bin Imam Ali al-Hadi, peace be upon him (died in year 252 AH) (261 AH). The shrine of Imam Muhammad al-Dari, whose lineage ends with Imam al-Kadhim, peace be upon him (died in the year 300 AH). The shrine of the daughters of Al-Kadhim, peace be upon them, in the Dujail district. The shrine of the daughters of Al-Hassan, peace be upon them, in the Al-Jalam area. The shrine of safe daughter of Imam al-Hassan, peace be upon him. The shrine of Ibrahim bin Malik Al-Ashtar Al-Nakh&#39;i, may God be pleased with them. The shrine of Sheikh Muhammad Al-Jajiri (died in the year 590 AH). The shrine of Sheikh Kamer bin Hilal (died in the year 1200 AH). The shrine of Ahmad al-Danbali al-Khoei (Sultan of Khoy) (died in the year 1200 AH). The shrine of Mahmoud al-Tahrani (died in the year 1304 AH). The shrine of Mahdi al-Shirazi (died in year 1308 AH). The shrine of Ibrahim Al-Nouri (died in the year 1320 AH). The shrine of Muhsin Al-Zanjani (died in year 1321 AH).</span></p><p><span style='font-size:20px'>Its safes and libraries: Treasury of Muhammad bin Abdul-Malik al-Zayat, Treasury of al-Fath ibn Khaqan, Canadian treasury, Treasury of Ali bin Yahya al-Munajj, Military Public Library, Imam Muhammad al-Mahdi Library, Samarra Public Library, Ibn Battuta Library, Manuscripts of the Public Military Library at Imam Shirazi School (may his secret be sanctified) ).</span></p><p><span style='font-size:20px'>The Persians occupied this area in the centuries following the birth of the Prophet of God, Jesus Christ, peace be upon him, and they took the fortress site of Samarra as a strategic and military center during their fight against the Romans. . The Abbasid ruler Harun al-Rashid dug the first river in the city and built a palace for him named after him. He wanted to build a city in the Qatul area in Samarra, but he did not complete it. (198 - 218 AH): During the reign of the Abbasid ruler al-Ma&#39;mun, the village of al-Matira was built, which was one of the parks of Baghdad and Samarra. Year 221 AH: Al-Mu&#39;tasim established the city of Samarra, the capital of their empire, which is called the Abbasid state. From the year (221 AH) to the year (279 AH): Six Abbasid rulers (who call themselves caliphs) after al-Mu&rsquo;tasim made the city of Samarra their capital. In the year 223 A.H.: Al-Afshin (the military commander of Al-Mu&#39;tasim) arrived in the city of Samarra, with Babak and his brother captive. In the year 245 A.H., the Abbasid ruler Al-Mutawakkil built the city of Al-Mutawakkiliya and built the mosque and its famous minaret (Al-Malwiya). In the year 247 A.H., the deceased was assassinated</span></p><p><span style='font-size:20px'>He trusted and took power after him the victorious, so he moved to Samarra, and ordered all the people to move to the Mahouzah, to demolish the houses and take the veto to Samarra, and the Jaafari palaces, homes, residences and markets were destroyed. Year (254 AH): Imam Ali al-Hadi, peace be upon him, died and was buried in his home. 15 Sha&rsquo;ban al-Mu&rsquo;azzam in the year 255 A.H.: The birth of the Seal of the Guardians and the last of the twelve legal successors of the Prophet Muhammad, may God&rsquo;s prayers and peace be upon him and his family, Imam Muhammad al-Mahdi al-Hujjah ibn al-Hasan al-Askari, peace be upon them, in the house of his father and grandfather in Samarra. Year (255 AH): Al-Mutawakkil built for himself the city of Al-Mutawakkiliya, and took it as a site for himself and his followers near Samarra, until the latter was almost emptied of its people. (After the years 254 AH and 260 AH): When the two Imams Ali al-Hadi and al-Hasan al-Askari, peace be upon them, were martyred, their shrines and the shrines of their family who are all buried in their home, took a shrine around which buildings were built, houses and public homes were built, so the city preserved its construction until after the end of the Abbasid state. Year (333 AH): Nasir al-Dawla al-Hamdani expanded the city and surrounded it with a wall. In the year (260 AH): My concubines imprisoned Imam Hassan al-Askari, peace be upon him, and in the same year, he died, peace be upon him, and was buried next to his father, peace be upon him. In the year (279 AH): Al-Mu&rsquo;tamid left the city to take Baghdad as his stable and capital, six months before his death in the year (279 AH), and after the Abbasid rulers (caliphs) returned to Baghdad and made it their capital, the city of Samarra was abandoned and this authorized its ruin. Year (445 AH): The Bassari and Seljuk war took place in Medina. The year (1286 AH / 1869 AD): the governor of Baghdad, Midhat Pasha, issued an order making Samarra a district dependent on Baghdad, and its first mayor was Ali Bey. The year (1296 AH / 1879 AD): the Hamavans (a group of Kurds) attacked the city of Samarra and plundered it. In the year (1318 AH): a fatwa was issued from Samarra that overthrew the foreign interests exploiting the oppressed peoples under their will, as British companies tried to monopolize the cultivation and sale of tobacco in Iran. The religious authority, Grand Ayatollah Mirza Muhammad Hassan al-Shirazi, issued his famous fatwa prohibiting the sale of tobacco. The economy of these companies collapsed, forcing the King of Iran at the time to cancel the concessions, thus protecting the interests of Muslims in that country. The year (1335 AH / 1917 AD): the British occupied the city of Samarra during the First World War. Year (1335 A.H.): Some thieves ascended to the shrine of the two imams Ali al-Hadi and al-Hasan al-Askari, peace be upon them, and tore down 25 gold-coated bricks from the honorable dome of the shrine. Year (1343 AH / 1924 AD): a cholera epidemic occurred in the city, and injuries increased and deaths rose, and most of the people fled from it. The year 1920 AD: The Great Iraqi Twentieth Revolution against the brutal British occupation spread to the city of Samarra and its people participated in it with their families in all regions of Iraq. The year (1359 AH / 1941 AD): The people of Samarra revolted against the English army, when the governor of Baghdad at the time told them that the British wanted to occupy the Samarra train station and cut off the railway in the south of the city, during the government of Rashid Ali al-Kilani on May 23 / 1941 AD during the reign of Prince Abdul Ilah&#39;s guardianship over his nephew, King Faisal II, King of Iraq at the time. Year (1250 AH): Sheikh Zain al-Abidin al-Salmani aged the city wall, and one of the kings of India spent on its reconstruction. Year (1258 AH): King Amjad Ali Shah reconstructed and reconstructed the city wall. Year (1294 AH / 1878 AD): During the days of the Ottoman Empire, the first bridge was erected on the Tigris River, linking the city of Samarra to the other bank of it. In the year 1258 AH, King Amjad Ali Shah reconstructed the city wall and reconstructed it by Sayyid Ibrahim bin Sayed Baqir al-Qazwini. The middle of the thirteenth century AH: Mirza Muhammad Hassan al-Shirazi carried out several works in the city and made it a prestigious scientific center by building a large scientific school that is still standing today. Year (1952 AD): Work began to implement the Tharthar project, which is considered one of the most important irrigation projects in the city. The year (1375 AH / 1955 AD): the Iraqi government, during the reign of King Faisal II, ordered the construction of a street extending from Bab al-Qatul to the door of the holy military threshold, after demolishing the aforementioned gate. The year (1299 AH / 1881 AD): the first primary school was built in the city of Samarra. 1976 AD: The city was annexed as a judicial center affiliated to Salah al-Din Governorate, after it was affiliated with most of the cities of this governorate, to the governorate of Baghdad. The last week of December 2005: Issuance of the Law No. 19 of 2005 for the Administration of Holy Shrines and Honorable Shiite Shrines issued by the elected National Assembly, which is based on the Iraqi constitution, whose legitimacy was popularly ratified on 10/15/2005, and which returned the administration of the military holy shrine to the Endowment Diwan The Iraqi Shiite after it was affiliated with the Iraqi Sunni Endowment, which was formed after the dissolution of the Iraqi Ministry of Endowments and Religious Affairs, months after the fall of the dictatorial regime on 9/4/2003 AD, but unfortunately the esteemed Sunni Endowment did not accept the implementation of the law and handing over the holy shrine to the Shiite Endowment Administration . 22/2/2006 AD, the cronies of the former regime, aided by the oddities of al-Qaeda outside Iraq, carried out the biggest crime in the history of Samarra after the killing of its imams Ali al-Hadi and al-Hasan al-Askari, peace be upon them, namely the tragic bombing of their shrine and honorable dome, which is considered the biggest violation of their sanctity after their testimony. , which is also a great loss for the honorable people of Samarra in particular and for the Iraqis in general, with this great loss and their loss as well, an archaeological building that is the oldest among Iraq&rsquo;s holy shrines, over a thousand years old. Distinguished, adults only five people, control organized</span></p><p><span style='font-size:20px'>yum terrorist base on the city. June 2007 A.D., the cronies of the former regime, aided by the oddities of al-Qaeda from outside Iraq, completed their crime in the previous catastrophe, demolishing the two minarets of the Holy Military Shrine. April 2008 A.D. The beginning of the Nusra journey undertaken by the members of the holy shrines Husseiniya and Abbasid with the assistance of the Technical Committee for the Reconstruction of the Military Kindergarten appointed by the Iraqi Prime Minister, where the ruins of the two tragedies were removed within 14 days only after the inability of the Turkish company that the Iraqi government had commissioned the reconstruction to raise The ruins within several months, and as a result of that, the Iraqi Prime Minister at the time, Nuri Kamel al-Maliki, canceled the company&rsquo;s contract, and assigned the matter to the aforementioned technical committee. April 17, 2009 AD (Technical Committee for the Reconstruction of the Al-Sharif Military Kindergarten) completes the construction of the sanctuary, dome and minarets of the two shrines of the two military imams, peace be upon them, in 11 months and by the hands of the Iraqis only, after the mentioned Turkish company was unable to build. 2010 AD The expansion of the military campus, peace be upon them, began by 100% as a horizontal area, and 200% as a total vertical area, as the new campus consists of two floors.</span></p>",
   "fa": "<h1 dir='rtl'><span style='font-size:48px'><span style='color:#f39c12'>تاریخ سامرا</span></span></h1><p dir='rtl'>&nbsp;</p><p dir='rtl'><img alt='' src='https://www.atlastours.net/iraq/alaskareyya_shrine.jpg' style='height:349px; width:560px' /></p><p dir='rtl' style='text-align:justify'><span style='font-size:20px'>اصل نام (سامرا) به بقیه اسامی آرامی در عراق برمی گردد که با حرف مفقود الف خاتمه می یافتند، مانند (کربلا) (بعقوبه) و (کربلا) و تبدیل به (سامرا و کربلا) شدند. در حالی که از نام شهر بعقوبه به جای حرف &laquo;الف&raquo; به &laquo;طاء&raquo; تبدیل شد و به صورت (بعقوبه) در آمد و از دیدگان خشنود شد، پیش از آنکه حروف آن نام با آن ترکیب شود. فرم (سامرا). کشف شهر سامرا به دوران باستان باز می گردد که توسط مورخ رومی آمینس مارکالیس (320-390 پس از میلاد) به صورت (سومراء) و مورخ یونانی زوسیموس آن را به صورت سوما ذکر کرده است.آشوری. بودن (شمره) و همه اینها قبل از اینکه دوباره توسط حاکم عباسی آل معتصم ساخته شود انجام شد.</span></p><p dir='rtl' style='text-align:justify'><span style='font-size:20px'>موقعیت جغرافیایی این شهر در کرانه شرقی رود دجله در حدود 118 کیلومتری شمال پایتخت بغداد در طول جغرافیایی 43 درجه و 45 دقیقه و در عرض جغرافیایی 34 درجه و 35 دقیقه واقع شده است.دولت مدرن عراق در سال 1920 پس از انقلاب کبیر عراق بیستم، و وابسته به مناطق (تکریت، بلد، دجیل) بود و رژیم قبلی در اوایل دهه هفتاد، استان صلاح الدین را ایجاد کرد که شامل تمام شهرهای سامرا می شد. ولسوالی و سایر شهرها و روستاهای استان های کرکوک و نینوا و به جای اینکه سامرا را مرکز استان جدید قرار دهد، بخش تکریت را گسترش داد و آن را ناحیه و سپس مرکز استان جدید قرار داد که شهر سامرا وابسته بود، از شمال و شمال غرب، استان بغداد از جنوب، استان دیالی از شرق، استان الانبار از غرب،</span></p><p dir='rtl' style='text-align:justify'><span style='color:#e74c3c'><span style='font-size:20px'>سامرا در دوران باستان</span></span></p><p dir='rtl' style='text-align:justify'><span style='font-size:20px'>1- سامرا در دوران ماقبل تاریخ شهر کنونی اربیل که در تاریخ اسلام در اربیل و در تاریخ آشوری در اربیل شناخته می شود، به دلیل وجود قدیم ترین شهر مسکونی در زمان ما، چه در عراق و چه در جهان به شمار می رفته است. تداوم مسکن در آن از دوران آشور تا امروز و پس از آن، پس از آن به نظر می رسد که سامارا قدیمی ترین آنها است، زیرا کاوش های باستان شناسی ثابت کرده است که مکان آن از دوران ماقبل تاریخ مسکونی بوده است. پروفسور باستان شناسی آلمانی هرتسفلد در آن مقبره ای از آن طبقات، بین دندان سنگی و آثار دوران عباسیان، در حدود یک مایلی جنوب خانه (خلیفه)، یعنی خانه عمومی سه ایوان، آشکار کرد. نوعی سفال منقوش به نام (سفال سامرا) یافت شد که نمایانگر یکی از نقش های ماقبل تاریخ است که در بالا به آن اشاره شد و علاوه بر محوطه باستانی که این سفال برای اولین بار در آن کشف شد (نقش فرهنگ سامارا) نامیده شد. از آنها در شمال قبرستان فوق الذکر است و دیگری در جنوب سامره بر کرانه دجله بالای سینه قائم و تل سوان نام دارد و نام این مکان در نوشته های آشوری آمده است. تصویری (سو - اور - مار - تا) و این مکان در روزهای اشغال عراق توسط پارسیان اهمیت زیادی در مبارزه با رومیان به ویژه و به دلیل مجاورت با رودخانه معروف به کانال کسروی داشت. .</span></p><p dir='rtl' style='text-align:justify'><span style='font-size:20px'>2- سامرا در دوران پس از تاریخ، زمانی سامرا را مگس می&zwnj;نامیدند. ماری بن سلیمان، مورخ کرسی ایلخانی، آنچه را نشان می&zwnj;دهد که این نام برای سامرا 393 سال قبل از تاریخ اسکندر می&zwnj;شناخته است. عالیه سالی که مریم مقدس درگذشت صالحه. این نام قدیمی است و ممکن است به دوران آرامی ها و دوران اشغال عراق توسط یونانیان برگردد و تا پایان قرن هفتم مهاجرت ادامه داشته و شاید تا بیشتر از آن باقی مانده باشد، اما نام آن در تاریخ ذکر شده است. همانطور که نشان خواهیم داد کتابهای مسیحی بیشتر از کتب اسلامی است و تیرهان در شکل لفظی خود به زبان فارسی بیشتر از زبانهای سامی نزدیک است، در مقابل سامارا که متعلق به زبانهای باستانی عراق است که نام آن است. منطقه قبل از (تیرهان). منطقه سامرا در ایام اشغال عراق توسط ساسانیان به تیرهان معروف بود. احمد بن ابی یعقوب می گوید: راز کسانی بود که در اوایل، بیابانی از سرزمین تیرهان را بدون معماری می دیدند. (حقیقت این است که کلمه صحرا خلاف واقعیت است زیرا زمین کشاورزی حاصلخیز آن در دجله قرار دارد و از سه طرف با آب احاطه شده است که شبیه شبه جزیره است) و در آن صومعه ای برای مسیحیان وجود داشت. جایی که خانه سلطان معروف به مجلس عوام شد و صومعه خانه پول شد. ابوالحسن مسعودی با ذکر موقعیت سامره گفت: در کشور کشور هوا است. و نیز گفت: پس معتصم به محل سامره رفت و خانقاهی معمولی برای نصارا بود، عده ای از اهل صومعه نام آن مکان را پرسیدند، گفت: معروف است به سامارا معتصم به او گفت: منظور از سمره چیست؟ گفت: در کتب گذشته و امتهای گذشته می یابیم که شهر سام بن نوح است. معتصم به او گفت: از کدام کشور است و به چه چیز اضافه شده است؟ گفت: از کشور پرواز به آن اضافه می شود. از توصیف ابن سراخیون از نهر اسحاقی فهمیده می شود که این پرواز شامل سمت غربی این نقطه بوده است. از ابن خوردذبه یاد کرد، گفت: تکریت... و تیرهان، و سنت و حدیث... گفت که در کوته شهر موصل. قدامه گفت: و چون به آثار مشرق رسیدیم به آثار مغرب بازگردیم. او این را در کتاب خود تکرار کرد. این منطقه از اواخر قرن اول هجرت در زمان ولید بن عبدالملک مشهور بود و پس از او در اخبار کاتولیکوس نسطوری (صلیبه زاخا) آمده است.</span></p><p dir='rtl' style='text-align:justify'><span style='font-size:20px'>که از اهل تیرهان بود و در المدائن آموخت و مد البجری را اسقف تیرهان کرد. این نام پس از آن نیز همچنان به کار می رود، به این معنا که سرگیس کاتولیک نسطوری، قیم را شاگرد خود را به اسقف در تیرهان گماشته بود و در روزگار او متوکل الله العباسی کشته شد. -عمروالله العباسی، مکخه بن سلیمان القنکانی اسقف التیرهان و نرسی اسقف این منطقه در برخی از عصر عباسیان آل ناصر لی الدین الله (575-622 هجری) بوده است. مغولان در سال 656 هجری قمری دولت عباسیان را به امانت گرفتند و امانوئل پس از این تاریخ اسقف کشور شد. در زمان پادشاهی اباقا خان ابن هولاکو (663 - 680 ه.ق) برکیشوآ اسقف آن بود.</span></p><p dir='rtl' style='text-align:justify'><span style='text-align:justify'><span style='color:#e74c3c'><span style='font-size:20px'>تأسیس پایتخت، سامرا</span></span></span></p><p dir='rtl' style='text-align:justify'><span style='font-size:20px'>همانطور که مشخص است خانه&zwnj;هایی در حاشیه رودخانه&zwnj;ها ساخته می&zwnj;شوند تا از یک سو برای جوامع کشاورزی در گذشته تسهیل شود و از سوی دیگر امکان استفاده از رودخانه&zwnj;ها برای تجارت در حمل و نقل کالا از شهری به شهر دیگر فراهم شود. این شهر در مکانی ساخته شده است که از زمان های قدیم محل سکونت عراق بوده است و ساکنان آن سهمی از تمدن داشتند که به دوران باستان باز می گردد.حتی برخی از مورخان معتقدند که سامرا منطقه ای است که سومری ها از آنجا آمده اند و اولین شهر را پایه گذاری کرده اند. تمدن بشری در جنوب عراق که زمینه ساز تمدن ها و تمدن های متأخر عراق بود سایر کشورهای جهان باستان. این شهر به روشی جدید بازسازی شد و آن را (راز آن که دید) برگرفته از نام قدیمی آن همانطور که در تحلیل نامش پیداست یا بنابر آن به دلیل زیبایی خواستار آن بوده است. و گسترش بنای آن را که می خواست بینندگان را خشنود سازد، پس از ساخت مجدد آن نامی بر آن نهاد. و بر هر یک از دو فرض نام قدیم آن به آن برگردانده شده است که تا امروز باقی مانده است و این برخلاف کسانی است که می گویند این اسم از (راز الذین بینا) گرفته شده است. سامرا به عنوان پایتخت امپراتوری عباسیان در زمان سلطنت حاکم عباسی المعتصم بن هارون الرشید در سال (221 هجری قمری / 836 میلادی) ساخته شد که هشتمین (خلافت) عباسیان آن را ساختند. پایتختی جدید، سپس پسرش الواثق آن را گسترش داد و به حداکثر رساند. پس از مرگ مأمون بن هارون الرشید، برادرش ابواسحاق محمد ملقب به معتصم در سال (218 هجری قمری 833 میلادی) حکومت شاهنشاهی عباسیان را به دست گرفت، از ترس اینکه عراقی ها و بقیه اعراب اگر لشکر او را تشکیل می دادند بر ضد او روی می آوردند تا اینکه تعداد سربازانش از ترکان به حدود (70) هزار مملوک رسید و این سربازان ترک اگر بر حیوانات سوار بودند با آنها می دویدند و مردم را شوکه می کردند. به طور تصادفی تا زمانی که عراقی هایی که اوباش را به کشتن یکدیگر تشویق می کردند از آنها خسته شدند، بنابراین خون آنها به هدر رفت. چندین مکان خارج از بغداد. معتصم به دنبال مکانی برای ساختن پایتخت جدید خود رفت و هنگامی که در حال بررسی مکان&zwnj;ها بود، به مکانی در ۱۱۸ کیلومتری بغداد رسید و در آنجا صومعه&zwnj;ای برای مسیحیان پیدا کرد، بنابراین سه روز در آنجا ماند. مطمئن شوید که مغازه برای او مناسب است، در سال 221 هجری قمری، شهر خود را طراحی کرد که آن را &laquo;راز الذی الذین&raquo; در آن مکان نامید، یک منبع تاریخی ذکر کرده است که معتصم زمانی که تمایل به انتخاب محل شهر سامرا، جایی که فقط آن صومعه برای مسیحیان وجود داشت، از راهبان درباره نام مکانی که در آن بودند پرسید. برخی از راهبان به او گفتند: (ما در کتاب های قدیمی خود می بینیم که این مکان را راز دیدنده گویند و اینکه در شهر سام بن نوح بوده و در اعصار بعد از پادشاهی خواهد ماند... گفت: من به خدا سوگند. آن را می&zwnj;سازد و پایین می&zwnj;آورد و برای پسرم می&zwnj;آورد) شهر جدید انواع درختان میوه از همه کشورها داشت و همه جا باغچه&zwnj;ها کاشته شده بود. برخی منابع تاریخی حاکی از آن است که معتصم پس از آنکه با اشتیاق فراوان محل سامرا و بنای آن را انتخاب کرد، دستور داد تا ترکان پادشاهی خود (لشکریان و رهبران او) در مکان های خاصی در شهر مستقر شوند و او فرمان داد. که با عناصر دیگر شهروندان ایالت او در آنجا مخلوط نشوند تا اطاعت خود را از او خدشه دار نکنند و ادامه پیدا نکند.حدود سه سال پیش مردم به آنجا آمدند و ساختمان های بلندی در آن ساختند که لشکریان را نظامی دانست و سامرا در عهد بنی العباس به یکی از شهرهای مهم تبدیل شد و از جمله شهرنشینی ها بود که معتصم پادگان های نظامی برای اسکان (250) هزار سرباز و سرباز ساخت. اصطبلی که 160 هزار اسب را در خود جای می داد. شهری که شهرنشینی آن در چند سال گسترش یافت، به عنوان شهر سامرا شناخته نمی شود، تا زمانی که شهرنشینی به فاصله (35) کیلومتر در هر دو ساحل رود دجله گسترش یافت.</span></p><p dir='rtl' style='text-align:justify'><span style='text-align:justify'><span style='color:#e74c3c'><span style='font-size:20px'>درگذشت ستاره سامرا پایتخت</span></span></span></p><p dir='rtl' style='text-align:justify'><span style='font-size:20px'>هنگامی که مؤسس شهر سامرا - پایتخت وقت عباسیان - معتصم در سال 227 هجری قمری درگذشت، پسرش هارون الواثق متوفی در سال 232 هجری قمری قدرت را به دست گرفت.المتوکل بن. معتصم که از پیروان اهل بیت علیهم السلام یکی از ظالم ترین حاکمان سامرا بر مسلمانان علیه مسلمانان بود، در سال 236 هجری قمری با تخریب قبر امام به حکومت رسید. حسین بن علی علیه السلام در کربلای مرکزی عراق خانه ها و ساختمان های اطراف را ویران می کند و از زیارت مردم جلوگیری می کند تا از ارزش های انقلاب که همیشه کاشته بود الهام نگیرند. در دل قیام کنندگان علیه ظلم در هر زمان و مکان، ظالم ترین و ظالم ترین، پس با نمادهای حرم امامان هدایت و جانشینان پیامبر صلی الله علیه و آله و سلم جنگیدند. خانواده اش. بدین ترتیب پس از متوکل، پسرش المنتصر، و پس از او یاور، و معتز که در زمان او در سال 253 هجری قمری در سامرا به ناآرامی قیام کرد و با آن حضرت موافقت کرد. علی الهادی علیه السلام به دست امرای بنی العباس در سامرا به شهادت رسید و آن هم در 27 جمادی الاخر سال 254 هجری قمری بود که احمد متوکل بر او دعا کرد. خیابان معروف به خیابان ابی احمد و اهل شاو است</span></p><p dir='rtl' style='text-align:justify'><span style='font-size:20px'>سامرا، شهر اصلی آن زمان که تعداد مردم شرکت کننده در تشییع جنازه امام هادی علیه السلام و گریه های شدید آنان بر فراق آن حضرت و برای جلوگیری از کودتای مردم علیه حکومت وحشیانه عباسیان، شرکت کردند. - معتز دستور داد تا تابوت را به خانه امام برگردانند و در آن به خاک سپردند که در حال حاضر محل بنای حرم مطهر نظامی است که شامل حرم امامان علی الهادی و الحسن آل است. -عسکری علیهم السلام و بقیه بستگانشان از اهل بیت علیهم السلام. سپس بعد از معتز و مهتدی و بعد از او معتمد سلطنت کرد، چنانکه در زمان حکومت او شهر پس از آن باقی ماند و مقر حکومت شاهنشاهی عباسی را بازگرداند (که ظاهراً به دروغ و دروغ است). به دروغ خلافت خوانده اند) به بغداد، و از سامرا پنجاه و چهار سال نگذشته بود که در آن هشت نفر از امپراتوران بنی عباس سلطنت کردند. -واثق، المتوکل، المنتصر، المستعین، معتز، مهتدی، و المعتمد.</span></p><p dir='rtl' style='text-align:justify'><span style='text-align:justify'><span style='color:#e74c3c'><span style='font-size:20px'>شرح سامرا در عصر مدرن</span></span></span></p><p dir='rtl' style='text-align:justify'><span style='font-size:20px'>آثار باستان شناسی آن شهر با دیواری چند ضلعی به شکلی که میل به چرخش داشت احاطه شده بود، محیط آن 2 کیلومتر بود و قطر آن از 680 متر تجاوز نمی کرد، با گچ و آجر ساخته شده بود، ارتفاع آن به 7 متر می رسید. 19 برج و چهار دروازه یعنی باب القطول و باب الناصریه و باب الملتوش و دروازه بغداد و این دیوار تا سال (1356 ق / 1936 م) نمایان بود. باغ های عمومی و خصوصی در سرتاسر شهر گسترده شده بود و در دهه های اخیر موزه ای در آن افتتاح شده است که در آن دست نوشته ها و عکس های مهمی از آثار باستانی آن قرار داده شده است.247 هجری قمری، العاشیق و کاخ المعشوق (ساخته شده توسط معتمد عباسی در 264 هجری قمری، قصر المعتصم (الجوثق الخاقانی)، قصر مختار، قصر وزیری، کاخ العروس، قصر جعفری، شهر المتوکلیه ( 15 کیلومتری شمال سامرا)، کاخ الجس، بیرکت السباع، گنبد صلیبی، خانه عمومی، تل الساوان، و دیوار سامرا. مغازه ها و محله های آن عبارتند از العابد، البوگل، البوبدری، البنیسان، محله الغربیه، القطول، القلعه و محله الشرقیه توسعه شهر آغاز شد. در دوران معاصر شامل چندین محله مسکونی از جمله محله الذبط، محله الجبیریه، محله الاراموشیه، محله القادسیه و محله المعلم می شود و گسترش محوطه ساختمان امروزه نیز وجود دارد. خیابان های آن عبارتند از: خیابان الخلیج، خیابان الصریحا (معروف به خیابان الاعظم)، خیابان الحیر الاول، خیابان ابی احمد بن الرشید و خیابان الترکی برگمش.. مساجد آن بزرگ هستند. مسجد سامرا که توسط معتصم در آغاز بنای شهر در سال 221 هجری قمری ساخته شد. مسجد جامع المتوکلیه در سال 245 هجری قمری که توسط حاکم عباسی متوکل ساخته و ساخته شده و مناره معروف آن (الملویه) بزرگ است. مسجد ابی دلف در مرکز خرید دوم خود که در حدود 15 کیلومتری شمال شهر قرار دارد و هر دو مسجد از آثار مهم عباسیان در شهر به شمار می روند. مسجد ارگ، مسجد حسن پاشا، مسجد حمید الحسون، مسجد سید درویش، مسجد البرحمن، مسجد علی بن ابی طالب علیه السلام، مسجد الحاج صالح الرحمنی، مسجد الارقم، اولاد الرحمن -مسجد حسن علیه السلام مسجد الفاروق.</span></p><p dir='rtl' style='text-align:justify'><span style='text-align:justify'><span style='color:#e74c3c'><span style='font-size:20px'>امامزاده ها و امامزاده ها</span></span></span></p><p dir='rtl' style='text-align:justify'><span style='font-size:20px'>حرم امام علی الهادی و حسن عسکری علیهما السلام مهم ترین بنای شهر سامرا است که شامل حرم بانو نرگس همسر امام حسن عسکری نیز می باشد. سلام الله علیها (متوفی سال 260 هجری قمری) و مقبره بانو حکیمه دختر امام جواد علیه السلام (متوفی سال 260 هجری قمری). گنبد زیرزمین غیبت بر فراز زیرزمین خانه سه امام علی الهادی و حسن عسکری و لاهیجه بن الحسن علیهما السلام قرار دارد. شهر سامرا دارای شهرها و روستاهای کوچک تری است که دارای زیارتگاه های فراوان اهل بیت و اصحاب علیهم السلام است: مرقد سید محمد بن امام علی الهادی علیه السلام (متوفی سال 252 هجری قمری) (261 ق). مرقد امام محمد الدری که نسبش به امام کاظم علیه السلام (متوفی سال 300 هجری قمری) ختم می شود. مزار دختران الکاظم علیهما السلام در منطقه دجیل. حرم دختران الحسن علیهما السلام در منطقه الجلم. حرم دختر سالم امام حسن علیه السلام. مرقد ابراهیم بن مالک الشتر النخعی رضی الله عنهم. مرقد شیخ محمد الجاجیری (متوفی به سال 590 هجری قمری). مرقد شیخ کمر بن هلال (متوفی به سال 1200 هجری قمری). مرقد احمد الدنبلی الخویی (سلطان خویی) (متوفی به سال 1200 هجری قمری). مرقد محمود الطهرانی (متوفی به سال 1304 هجری قمری). حرم مهدی شیرازی (متوفی سال 1308 ه.ق). مرقد ابراهیم النوری (متوفی سال 1320 ه.ق). حرم محسن الزنجانی (متوفی سال 1321 ه.ق).</span></p><p dir='rtl' style='text-align:justify'><span style='font-size:20px'>گاوصندوق و کتابخانه های آن: خزانه محمد بن عبدالملک الزیات، خزانه الفتح بن خاقان، خزانه کانادا، خزانه علی بن یحیی المنجج، کتابخانه عمومی نظامی، کتابخانه امام محمد المهدی، کتابخانه عمومی سامرا. ، کتابخانه ابن بطوطه، نسخه های خطی کتابخانه نظامی عمومی مدرسه امام شیرازی (رازش حرم) .</span></p><p dir='rtl' style='text-align:justify'><span style='font-size:20px'>ایرانیان در قرن&zwnj;های پس از میلاد پیامبر خدا، عیسی مسیح (ع) این منطقه را اشغال کردند و در جریان نبرد با رومیان، قلعه سامرا را به عنوان یک مرکز استراتژیک و نظامی گرفتند. حاکم عباسی هارون الرشید اولین رودخانه شهر را حفر کرد و برای او قصری به نام خود ساخت و خواست شهری در منطقه قاتول در سامرا بسازد که آن را کامل نکرد. (198 - 218 هجری قمری): در زمان حکومت عباسی مأمون، روستای المطیره ساخته شد که یکی از پارک های بغداد و سامرا بود. در سال 221 هجری قمری: المعتصم شهر سامرا، پایتخت امپراتوری آنان را که دولت عباسیان نامیده می شود، تأسیس کرد. از سال (221 هجری قمری) تا سال (279 هجری قمری): شش نفر از حاکمان عباسی (که خود را خلیفه می نامند) پس از معتصم، شهر سامرا را پایتخت خود قرار دادند. در سال 223 هجری قمری: الافشین (فرمانده نظامی معتصم) به همراه بابک و برادرش به اسارت به شهر سامرا رسید. در سال 245 هجری قمری، حاکم عباسی، متوکل، شهر متوکلیه را بنا کرد و مسجد و مناره معروف آن (الملویه) را ساخت. آن مرحوم در سال 247 هجری قمری ترور شد</span></p><p dir='rtl' style='text-align:justify'><span style='font-size:20px'>پس از او پیروز اعتماد کرد و قدرت را به دست گرفت، پس به سامرا رفت و به همه مردم دستور داد که به سوی ماحوزه حرکت کنند و خانه&zwnj;ها را خراب کنند و حق وتو را به سامرا ببرند و کاخ&zwnj;ها و خانه&zwnj;ها و خانه&zwnj;ها و بازارهای جعفری ویران شد. . سال (254 هجری قمری): امام علی الهادی علیه السلام درگذشت و در خانه خود به خاک سپرده شد. 15 شعبان المعظم سال 255 هجری قمری: میلاد خاتم ولی و آخرین خلف از دوازده جانشین شرعی پیامبر اکرم صلی الله علیه و آله و سلم امام محمد. مهدی حجه بن الحسن العسکری علیهما السلام در خانه پدر و جدش در سامرا. سال (255 هجری قمری): متوکل شهر متوکلیه را برای خود بنا کرد و آنجا را برای خود و یارانش در نزدیکی سامرا قرار داد تا اینکه تقریباً سامرا از مردمش خالی شد. (بعد از سالهای 254 هجری قمری و 260 هجری قمری): هنگامی که دو امام علی الهادی و حسن عسکری علیهما السلام به شهادت رسیدند، مزار آنها و حرم اهل بیتشان که همه در خانه خود مدفون است. زیارتگاهی گرفت که اطراف آن ساختمان&zwnj;ها، خانه&zwnj;ها و خانه&zwnj;های عمومی ساخته شد، بنابراین شهر بنای خود را تا پایان دولت عباسی حفظ کرد. سال (333 هجری قمری): ناصرالدوله حمدانی شهر را گسترش داد و اطراف آن را با دیوار محصور کرد. در سال (260 هجری قمری): کنیز من امام حسن عسکری علیه السلام را زندانی کردند و در همان سال وفات یافت و در جوار پدرش علیه السلام به خاک سپرده شد. در سال (279 هجری قمری): المعتمد شش ماه قبل از مرگش در سال (279 هجری قمری) و پس از بازگشت امرای عباسی (خلفا) به بغداد، شهر را ترک کرد تا بغداد را به عنوان اصطبل و پایتخت خود بگیرد. آن را پایتخت خود کردند، شهر سامرا متروک شد و این امر اجازه ویرانی آن را داد. سال (445 هجری قمری): جنگ بصری و سلجوقیان در مدینه رخ داد. سال (1286 هجری قمری / 1869م): والی بغداد، میدحات پاشا، فرمانی صادر کرد که سامرا را ناحیه ای وابسته به بغداد قرار داد و اولین شهردار آن علی بیگ بود. سال (1296 هجری قمری / 1879م): هاماوانیان (گروهی از کردها) به شهر سامرا حمله کردند و آن را غارت کردند. در سال 1318 هجری قمری: فتوایی از سامرا صادر شد که منافع بیگانگان را که به میل خود از مردم ستمدیده استثمار می کردند، سرنگون کرد، زیرا شرکت های انگلیسی تلاش کردند کشت و فروش تنباکو در ایران را در انحصار خود درآورند. مرجع تقلید آیت الله العظمی میرزا محمد. حسن شیرازی فتوای معروف خود را مبنی بر منع فروش تنباکو صادر کرد که اقتصاد این شرکت ها به هم ریخت و پادشاه وقت ایران مجبور به لغو امتیازات شد و بدین ترتیب از منافع مسلمانان آن کشور محافظت کرد. سال (1335 ق / 1917 م): انگلیسی ها در جنگ جهانی اول شهر سامرا را اشغال کردند. سال (1335 هجری قمری): عده ای از دزدان بر حرم امامان علی الهادی و حسن عسکری علیهم السلام عروج کردند و 25 خشت طلایی از گنبد شریف حرم پاره کردند. سال (1343ق / 1924م): بیماری وبا در شهر رخ داد و جراحات فزونی یافت و مرگ و میر بالا رفت و بیشتر مردم از آن گریختند. سال 1920 میلادی: انقلاب کبیر بیستم عراق علیه اشغال وحشیانه بریتانیا به شهر سامرا سرایت کرد و مردم آن با خانواده خود در تمام مناطق عراق در آن شرکت کردند. سال (1359 هجری قمری / 1941م): مردم سامرا بر ضد ارتش انگلیس قیام کردند، زمانی که والی وقت بغداد به آنها گفت که انگلیسی ها می خواهند ایستگاه قطار سامرا را اشغال کنند و راه آهن را در جنوب این کشور قطع کنند. شهر، در زمان حکومت رشید علی الکیلانی در 23 مه / 1941 میلادی در زمان ولایت شاهزاده عبدالله بر برادرزاده&zwnj;اش، ملک فیصل دوم، پادشاه وقت عراق. سال (1250 ه.ق): شیخ زین العابدین سلمانی دیوار شهر را کهنه کرد و یکی از پادشاهان هند برای بازسازی آن هزینه کرد. سال (1258 هجری قمری): شاه امجد علی شاه دیوار شهر را بازسازی و بازسازی کرد. سال (1294 هجری قمری / 1878 م): در روزگار امپراتوری عثمانی اولین پل بر روی رود دجله برپا شد که شهر سامرا را به ساحل دیگر آن متصل می کرد. در سال 1258 هجری قمری ملک امجد علی شاه دیوار شهر را بازسازی و توسط سید ابراهیم بن سید باقر قزوینی بازسازی کرد. اواسط قرن سیزدهم هجری قمری: میرزا محمد حسن شیرازی کارهای متعددی در این شهر انجام داد و با ساخت مدرسه علمی بزرگی که امروزه پابرجاست، آن را به مرکز علمی معتبر تبدیل کرد. سال (1952 میلادی): کار برای اجرای طرح ثارتار که یکی از مهم ترین طرح های آبیاری شهر به شمار می رود، آغاز شد. سال (1375 هجری قمری / 1955م): دولت عراق در زمان ملک فیصل دوم، پس از تخریب دروازه مذکور، دستور ساخت خیابانی از باب القطول تا درب آستانه مقدسه نظامی را صادر کرد. سال (1299 ق / 1881 م): اولین دبستان در شهر سامرا ساخته شد. 1976 میلادی: این شهر پس از وابستگی به اکثر شهرهای این استان، به عنوان مرکز قضایی وابسته به استان صلاح الدین، به فرمانداری بغداد ضمیمه شد. آخرین هفته دسامبر 2005: صدور قانون شماره 19 سال 2005 برای اداره عتبات عالیات و عتبات عالیات شیعیان صادر شده توسط مجلس ملی منتخب بر اساس قانون اساسی عراق که مشروعیت آن در تاریخ 15/10/15 به تصویب عموم رسید. /2005، و اداره حرم مطهر نظامی را به دیوان اوقاف بازگرداند. رژیم طاغوت در تاریخ 4/9/1382 شمسی، ولی متأسفانه اوقاف محترم اهل سنت اجرای قانون و واگذاری حرم مطهر به اداره اوقاف شیعیان را نپذیرفتند. در تاریخ 22/2/2006 میلادی، یاران رژیم سابق، با کمک عجیب القاعده در خارج از عراق، بزرگترین جنایت تاریخ سامرا را پس از کشتن امامان آن علی الهادی و حسن الحسن انجام دادند. - عسگری علیه السلام یعنی بمباران دلخراش حرم و گنبد شریفشان که بعد از شهادتشان بزرگترین تجاوز به حرمتشان محسوب می شود که برای مردم شریف سامرا به ویژه و برای مردم شریف سامرا ضایعه بزرگی است. به طور کلی عراقی ها با این ضایعه بزرگ و همچنین از دست دادن آنها، یک بنای باستان شناسی که قدیمی ترین بنا در بین عتبات عالیات عراق با قدمت بیش از هزار سال است.بزرگسالان فقط پنج نفر، کنترل سازمان یافته</span></p><p dir='rtl' style='text-align:justify'><span style='font-size:20px'>اصل نام (سامرا) به بقیه اسامی آرامی در عراق برمی گردد که با حرف مفقود الف خاتمه می یافتند، مانند (کربلا) (بعقوبه) و (کربلا) و تبدیل به (سامرا و کربلا) شدند. در حالی که از نام شهر بعقوبه به جای حرف &laquo;الف&raquo; به &laquo;طاء&raquo; تبدیل شد و به صورت (بعقوبه) در آمد و از دیدگان خشنود شد، پیش از آنکه حروف آن نام با آن ترکیب شود. فرم (سامرا). کشف شهر سامرا به دوران باستان باز می گردد که توسط مورخ رومی آمینس مارکالیس (320-390 پس از میلاد) به صورت (سومراء) و مورخ یونانی زوسیموس آن را به صورت سوما ذکر کرده است.آشوری. بودن (شمره) و همه اینها قبل از اینکه دوباره توسط حاکم عباسی آل معتصم ساخته شود انجام شد.</span></p><p dir='rtl' style='text-align:justify'><span style='font-size:20px'>موقعیت جغرافیایی این شهر در کرانه شرقی رود دجله در حدود 118 کیلومتری شمال پایتخت بغداد در طول جغرافیایی 43 درجه و 45 دقیقه و در عرض جغرافیایی 34 درجه و 35 دقیقه واقع شده است.دولت مدرن عراق در سال 1920 پس از انقلاب کبیر عراق بیستم، و وابسته به مناطق (تکریت، بلد، دجیل) بود و رژیم قبلی در اوایل دهه هفتاد، استان صلاح الدین را ایجاد کرد که شامل تمام شهرهای سامرا می شد. ولسوالی و سایر شهرها و روستاهای استان های کرکوک و نینوا و به جای اینکه سامرا را مرکز استان جدید قرار دهد، بخش تکریت را گسترش داد و آن را ناحیه و سپس مرکز استان جدید قرار داد که شهر سامرا وابسته بود، از شمال و شمال غرب، استان بغداد از جنوب، استان دیالی از شرق، استان الانبار از غرب،</span></p><p dir='rtl' style='text-align:justify'>&nbsp;</p><p dir='rtl' style='text-align:justify'><span style='text-align:justify'><span style='color:#e74c3c'><span style='font-size:20px'>&nbsp; سامرا در دوران باستان</span></span></span></p><p dir='rtl' style='text-align:justify'><span style='font-size:20px'>1- سامرا در دوران ماقبل تاریخ، شهر کنونی اربیل که در تاریخ اسلام در اربیل و در تاریخ آشوری در اربیل شناخته شده است، به دلیل وجود قدیمی ترین شهر مسکونی در زمان ما چه در عراق و چه در جهان به شمار می رفته است. تداوم مسکن در آن از دوران آشور تا امروز و پس از آن، پس از آن به نظر می رسد که سامارا قدیمی ترین آنها است، زیرا کاوش های باستان شناسی ثابت کرده است که مکان آن از دوران ماقبل تاریخ مسکونی بوده است. پروفسور باستان شناسی آلمانی هرتسفلد در آن مقبره ای از آن طبقات، بین دندان سنگی و آثار دوران عباسیان، در حدود یک مایلی جنوب خانه (خلیفه)، یعنی خانه عمومی سه ایوان، آشکار کرد. نوعی سفال منقوش به نام (سفال سامرا) یافت شد که نمایانگر یکی از نقش های ماقبل تاریخ است که در بالا به آن اشاره شد و علاوه بر محوطه باستانی که این سفال برای اولین بار در آن کشف شد (نقش فرهنگ سامارا) نامیده شد. از آنها در شمال قبرستان فوق الذکر است و دیگری در جنوب سامره بر کرانه دجله بالای سینه قائم و تل سوان نام دارد و نام این مکان در نوشته های آشوری آمده است. تصویری (سو - اور - مار - تا) و این مکان در روزهای اشغال عراق توسط پارسیان اهمیت زیادی در مبارزه با رومیان به ویژه و به دلیل مجاورت با رودخانه معروف به کانال کسروی داشت. .</span></p><p dir='rtl' style='text-align:justify'><span style='font-size:20px'>2- سامرا در دوران پس از تاریخ، زمانی سامرا را &laquo;مگس&raquo; می&zwnj;نامیدند. ماری بن سلیمان، مورخ کرسی ایلخانی، آنچه را نشان می&zwnj;دهد که این نام برای سامرا 393 سال قبل از تاریخ اسکندر می&zwnj;شناخته است. عالیه سالی که مریم مقدس درگذشت صالحه. این نام قدیمی است و ممکن است به دوران آرامی ها و دوران اشغال عراق توسط یونانیان برگردد و تا پایان قرن هفتم مهاجرت ادامه داشته و شاید تا بیشتر از آن باقی مانده باشد، اما نام آن در تاریخ ذکر شده است. همانطور که نشان خواهیم داد کتابهای مسیحی بیشتر از کتب اسلامی است و تیرهان در شکل لفظی خود به زبان فارسی بیشتر از زبانهای سامی نزدیک است، در مقابل سامارا که متعلق به زبانهای باستانی عراق است که نام آن است. منطقه قبل از (تیرهان). منطقه سامرا در ایام اشغال عراق توسط ساسانیان به تیرهان معروف بود. احمد بن ابی یعقوب می گوید: راز کسانی بود که در اوایل، بیابانی از سرزمین تیرهان را بدون معماری می دیدند. (حقیقت این است که کلمه صحرا خلاف واقعیت است زیرا زمین کشاورزی حاصلخیز آن در دجله قرار دارد و از سه طرف با آب احاطه شده است که شبیه شبه جزیره است) و در آن صومعه ای برای مسیحیان وجود داشت. جایی که خانه سلطان معروف به مجلس عوام شد و صومعه خانه پول شد. ابوالحسن مسعودی با ذکر موقعیت سامره گفت: در کشور کشور هوا است. و نیز گفت: پس معتصم به محل سامره رفت و خانقاهی معمولی برای نصارا بود، عده ای از اهل صومعه نام آن مکان را پرسیدند، گفت: معروف است به سامارا معتصم به او گفت: منظور از سمره چیست؟ گفت: در کتب گذشته و امتهای گذشته می یابیم که شهر سام بن نوح است. معتصم به او گفت: از کدام کشور است و به چه چیز اضافه شده است؟ گفت: از کشور پرواز به آن اضافه می شود. از توصیف ابن سراخیون از نهر اسحاقی فهمیده می شود که این پرواز شامل سمت غربی این نقطه بوده است. از ابن خوردذبه یاد کرد، گفت: تکریت... و تیرهان، و سنت و حدیث... گفت که در کوته شهر موصل. قدامه گفت: و چون به آثار مشرق رسیدیم به آثار مغرب بازگردیم. او این را در کتاب خود تکرار کرد. این منطقه از اواخر قرن اول هجرت در زمان ولید بن عبدالملک مشهور بود و پس از او در اخبار کاتولیکوس نسطوری (صلیبه زاخا) آمده است.</span></p><p dir='rtl' style='text-align:justify'>&nbsp;</p><p dir='rtl' style='text-align:justify'>&nbsp;</p>"
 }
 