import { css, html, CSSResultGroup } from 'lit';
import { customElement } from 'lit/decorators/custom-element.js';

import { AppElement } from '../app-debt/app-element';

import type { ListenerInterface } from '@alwatr/signal';

import type { TemplateResult } from 'lit';



declare global {
  interface HTMLElementTagNameMap {
    'page-about': PageAbout;
  }
}

@customElement('page-about')
export class PageAbout extends AppElement {



  static override styles: CSSResultGroup = css`
    :host {
      display: flex;
      justify-content:center;
      align-items:flex-start;
      position:relative;
    }
    *{
      box-sizing:border-box;
    }
    .content{
      width:40%;
      background-color:#ffff;
      border-radius:10px;
      margin:8em 3em 4em 0;
      box-shadow: 0 0 25px rgb(227 229 230 / 50%);
      overflow:hidden;
    }
    .sidebar{
      width:16vw;
      border-radius:6px;
      background-color:transparent;
      margin:8em 0 4em 3em;
      position:relative;
      position: sticky;
      top: 7em;
    }
    .image-post{
      width:16vw;
      height:16vw;
      background:url("/images/samarra.jpg") no-repeat center center /cover;
      border:4px solid #e4e8eb;
      background-color:transparent;
      border-radius: 10px 103px 10px 10px;
      box-shadow: 0 0 25px rgb(227 229 230 / 50%);
    }
    .content>p{
      text-align: justify;
      padding: 0 .2em;
    }
    .menu-sidebar{
      width:100%;
      height:fit-content;
      box-shadow: 0 0 25px rgb(227 229 230 / 50%);
      padding:1em .1em;
      margin:4em 0;
      border-radius:10px;
      background-color:#fff;
    }
    @media only screen and (max-width: 1440px) {
      .content{
        width:50%;
        margin:5em 1em;
      }
    }
    @media only screen and (max-width: 1024px) {
      .sidebar{
        display:none;
      }
      .content{
        width:90%;
        margin:5em 1em;
      }
    }
  `;

  protected _listenerList: Array<unknown> = [];

  override connectedCallback(): void {
    super.connectedCallback();
    // this._listenerList.push(router.signal.addListener(() => this.requestUpdate()));
  }

  override disconnectedCallback(): void {
    super.disconnectedCallback();
    this._listenerList.forEach((listener) => (listener as ListenerInterface<keyof AlwatrSignals>).remove());
  }

  protected override render(): TemplateResult {
    return html`
      <div class="sidebar">
        <div class="image-post" title="Samarra"></div>
        <div class="menu-sidebar">
          <p>أحدث المقالات</p>
          <ul>
            <li>المقال الأول</li>
            <li>المقال الثانی</li>
            <li>المقال الثالث</li>
            <li>المقال الرابع</li>
          </ul>
        </div>
      </div>
      <div class="content">
        <h1>تاريخ سامراء</h1>
        <p>
          سامراء في التاريخ واللغة
      
      
      
          يعود أصل اسم (سامراء) في أصله إلى سائر الأسماء الآرامية بالعراق التي كانت تنتهي بحرف الألف المقصور مثل (كربلا)
          (بعقوبا) وفي مراحل تاريخية لاحقة من تاريخ اللغة العربية التي ورثت تلك التسميات لبعض مدنها في أرض الرافدين أضيفت
          علامة الهمزة إلى مفردتي (سامرا) و(كربلا) فأصبحتا (سامراء وكربلاء) في حين استبدل حرف الألف بحرف التاء من اسم مدينة
          بعقوبا فأضحى يكتب (بعقوبة) ومعلوم أن مدينة سامراء في معظم تاريخ الدولة العباسية كانت باهرة في مشاهدها وعامرة في
          بناءها حتى كان قد أُطلق عليها زمنذاك بـ(سّره مَنْ رأى) قبل أن تُدمج حروف تلك التسمية بصيغة (سامراء). ويعود اكتشاف
          مدينة سامراء إلى عصور قديمة فقد ذكرها المؤرخ الروماني أميانس مرقلينس (320–390م) بصيغة (سومرا sumera) ونوه عنها
          المؤرخ اليوناني زوسيمس بصورة سوما saoma وفي التدوينات الآشورية جاء ذكر اسمها بصيغة (سرمارتا suurmrta) في حين ورد اسم
          سامراء في مصنفات الإخوة السريان على كونه (شومرا) وتم كل ذلك قبل يبنيها مجدداً الحاكم العباسي المعتصم.
      
          الموقع الجغرافي تقع المدينة على الضفة الشرقية لنهر دجلة وتبعد نحو 118 كم إلى الشمال من العاصمة بغداد، وتقع على خط
          طول 43 درجة و45 دقيقة، وعلى خط عرض 34 درجة و35 دقيقة، وقد كانت مدينة سامراء قضاءً تابعاً إلى لواء (محافظة) بغداد عند
          تأسيس الدولة العراقية الحديثة عام 1920م إثر ثورة العشرين العراقية الكبرى، وكانت تتبع لها نواحي (تكريت، بلد، الدجيل)،
          وقد قام النظام السابق باستحداث محافظة صلاح الدين أوائل السبعينيات، لتضم كل المدن التابعة لقضاء سامراء ومدن أخرى وقرى
          من محافظتي كركوك ونينوى، وبدلاً من جعل سامراء مركزاً للمحافظة الجديدة، وسّع ناحية تكريت وجعلها قضاءً ثم مركزاً
          للمحافظة الجديدة والتي تبعت لها مدينة سامراء، وأصبحت المحافظة الجديدة تضم سامراء كقضاء تابعٍ لتكريت مركز المحافظة
          الجديدة التي أصبحت مجاورة للمحافظات التالية: محافظات-السليمانية-وكركوك-وأربيل-ونينوى-صلاح الدين من الشمال والشمال
          الغربي, محافظة بغداد من الجنوب, محافظة ديالى من الشرق, محافظة الأنبار من الغرب,
      
      
      
          سامراء في غابر الأزمان
      
      
      
          1- سامراء في عصر ما قبل التأريخ كانت مدينة «أربيل» الحالية المعروفة في التاريخ الإسلامي بإربل وفي التاريخ الآشوري
          بأربيلا تُعدّ أقدم بلدة مسكونة في عصرنا هذا سواء في العراق أو في العالم، لاستمرار السكن فيها من العصر الآشوري إلى
          اليوم وبعده، ثمّ ظهر أن سامرا هي الأقدم منها، فقد أثبتت التنقيبات الآثرية في أطلالها أن موضعها كان آهلاً منذ أدوار
          ما قبل التاريخ. وقد كشف الأستاذ الآثاري الألماني هرزفيلد فيها عن مقبرة من تلك الأدوار، بين السنّ الصخري وآثار العصر
          العباسي على نحو من ميل واحد من جنوب دار (الخليفة)، أي دار العامة القائمة الأواوين الثلاثة، وعثر على نوع من الفخار
          المصبوغ أطلق عليها اسم (فخار سامرا) وهو يمثل دوراً من أدوار ما قبل التاريخ المشار إليه آنفاً، وقد سمي (دور ثقافة
          سامرا) إضافة له إلى الموضع الأثري الذي كشف فيه عن هذا الفخار أول مرة، ثمّ عثرت مديرية الآثار العراقية على موضعين
          آخرين في سامراء، يرتقي عصورهما إلى ذلك الزمن، أحدهما في شمالي المقبرة المتقدم ذكرها، والآخر في جنوبي سامرا على ضفة
          دجلة فوق صدر القائم ويسمّى تل صوان، وقد جاء اسم هذا الموضع في الكتابات الآشورية بصورة (سُرمارتا Su - Ur - Mar - Ta)،
          وكان لهذا الموضع في أيّام الاحتلال الفارسي للعراق شأن كبير في محاربتهم الرومان خاصّة، ولقربهِ من النهر المعروف
          بالقاطول الكسروي أي القناة الكسروية.
      
          2- سامراء في عصر ما بعد التأريخ كان يطلق في فترة ما على سامراء اسم «الطَّيرهان» ، وقد ذكر ماري بن سليمان مؤرخ كرسي
          البطاركة ما يفيد أن هذا الاسم كان معروفاً لسامراء قبل 393 سنة من تاريخ الأسكندر المقدوني وهي السنة التي توفي فيها
          مار ماري السليح. فالتسمية قديمة قد ترتقي إلى العصر الآرامي وعصر الاحتلال اليوناني للعراق، واستمرت إلى أواخر القرن
          السابع للهجرة ولعلها بقيت إلى أكثر منه، إلاَّ أنَّ اسمها مذكور في الكتب النصرانية أكثر مما في الكتب الإسلاميّة، كما
          سنبين، وطيرهان في صورته اللفظية أقرب إلى اللغة الفارسية منه إلى اللغات الساميّة، بالضد من سامرا التي تنتمي للغات
          العراقية القديمة، وهي اسم المنطقة السابق على (طيرهان). فكانت منطقة سامراء تعرف في أيام الاحتلال الساساني للعراق باسم
          «الطَّيرهان»، قال أحمد بن أبي يعقوب: كانت سُرّ مَن رأى في متقدم الأيام، صحراء من أرض الطَّيرهان لا عمارة بها (وحقيقة
          الأمر أن كلمة صحراء مخالفة للواقع لأن أرضها زراعية خصبة تقع على دجلة ويحيطها الماء من ثلاث جهات فيما يشبه شبه جزيرة
          )، وكان بها دَير للنصارى بالموضع الذي صارت فيه دار للسلطان المعروفة بدار العامة، وصار الدير بيت المال. وقال أبو
          الحسن المسعودي في ذكر موضع سامرا: وهو في بلاد كورة الطَّيرهان. وقال أيضاً: فانتهى المعتصم إلى موضع سامرا وكان هناك
          للنصارى دير عاديّ، فسأل بعض أهل الدير عن اسم الموضع، فقال: يعرف بسامرا. قال له المعتصم: وما معنى سامرا؟ قال: نجدها
          في الكتب السالفة والأمم الماضية أنّها مدينة سام بن نوح. فقال له المعتصم: ومن أي البلاد هي وإلامَ تُضاف؟ قال: من بلاد
          طيرهان، إليها تضاف. ويستفاد من وصف ابن سراخيون للنهر الإسحاقي، أن الطَّيرهان كانت تشمل الجانب الغربي من هذه البقعة،
          فقد ذكر أن الإسحاقي كان يمر بطيرهان حتّى يجيء إلى قصر المعتصم «ص 18، 19». وذكرها ابن خُرداذبه قال: تكريت...
          والطَّيرهان والسنّ والحديثة... قال ذلك في كتَّه كور الموصل. وقال قدامة: وإذ قد أتينا على أعمال المشرق فلنرجع إلى
          أعمال المغرب، فأولها حدّ الفرات تكريت والطَّيرهان والسنّ والبوازيج وارتفاعها على أوسط العبَر سبع مائة ألف ألف درهم.
          وكرّر ذلك في كتابه. وهذه المنطقة كانت مشهورة منذ أواخر القرن الأول للهجرة على عهد الوليد بن عبد الملك، ومن بعده فقد
          جاء في أخبار الجاثليق النسطوري (صليبا زخا) أنه كان من أهل الطَّيرهان وتعلّم بالمدائن وأنه نصب فشيون الباجرمي أسقفاً
          على الطَّيرهان. وبقي هذا الاسم مستعملاً بعد ذلك بدلالة أن الجاثليق النسطوري سرجيس رتب قيّوماً تلميذه أسقفاً
          بالطَّيرهان وفي أيامه قُتل المتوكل على الله العباسي، وكان إيشوعَزْخا أسقفاً على الطَّيرهان في خلافة المعتمد على الله
          العباسي، وفي الربع الأول من القرن الخامس للهجرة كان إيليا الأول أسقفاً على الطَّيرهان، وفي أيام القائم بأمر الله
          العباسي كان مكيخا بن سليمان القنكاني أسقفاً على الطَّيرهان، وكان نرسي أسقف هذه المنطقة في بعض عهد الناصر لدين الله
          العباسي (575 ـ 622 هـ). وقرَضَ المغولُ الدولة العباسية سنة 656هـ، وكان عمانوئيل أسقفاً على الطَّيرهان بعد هذا
          التاريخ. وفي بعض عهد الملك أباقاخان ابن هولاكو (663 ـ 680 هـ) كان بريخيشوع مطرانها.
      
      
      
          تأسيس سامراء العاصمة
      
      
      
          كما هو معلوم فإن الديار تُقام على ضفاف الأنهار لتسهيل أسباب العيش من جهة بالنسبة للمجتمعات الزراعية قديماً،
          ولإمكانية استغلال الأنهار لتجارة نقل البضائع من مدينة لأخرى من جهة ثانية. فقد شيدت المدينة على مكان كان مستوطنا
          عراقياً منذ قديم الزمان، وكان لسكانه نصيب من الحضارة تمتد إلى عصور سحيقة، بل يعتقد بعض المؤرخين أن سامراء هي المنطقة
          التي جاء منه السومريون الذين أسسوا أول حضارة بشرية في جنوب العراق كانت الأساس لما بعدها من الحخضارات العراقية
          وحضارات بلدان العالم القديم الأخرى. وقد أعيد بناء هذه المدينة بشكل جديد وأطلق عليها اسم (سر من رأى) اشتقاقاً من
          اسمها القديم كما يبدو في تحليل اسمها، أو لأن بانيها أرادها أن تكون كذلك، بسبب جمال ووسع بنائها الذي أراده ان يسر
          الناظرين، فجُعل لها الإسم حين بُنيت من جديد. وعلى أي الفرضين فإن اسمها القديم قد رجع إليها والذي بقي حتى اليوم، وهذا
          خلاف من يقول بأن اسمها هذا مشتق من (سر من رأى). بنيت سامراء لتكون عاصمة الإمبراطورية العباسية وذلك بعهد الحاكم
          العباسي المعتصم بن هارون الرشيد سنة (221هـ / 836 م) وهو ثامن (خلفاء) بني العباس ليجعلها عاصمة جديدة، ثمّ وسعها ابنه
          الواثق، وأوصلها إلى أقصى اتساعها المتوكل. حيث إنه وبعد وفاة المأمون بن هارون الرشيد تولى أمر الحكم الامبراطوري
          العباسي أخوه أبو أسحق محمد الملقب بالمعتصم سنة (218هـ 833م) وكان الأخير قد فقد الثقة بأبناء العراق ليوالوه بسبب ظلمه
          وميل أغلبهم أصلاً للخلفاء الشرعيين لآل البيت عليهم السلام، فأكثر من شراء الأتراك ليشكلوا جيشه خوفاً من انقلاب
          العراقيين وباقي العرب ضده لو كانوا يشكلون جيشه، حتى وصل عدد جنوده من الأتراك زهاء (70) ألف مملوك، وكان هؤلاء الجنود
          الأتراك إذا امتطوا الدواب ركضوا بها فيصدمون الناس بصورة عشوائية حتى سأمهم العراقيون الذين شجعوا الغوغاء على قتل
          بعضهم فتذهب دمائهم هدراً، فثقل ذلك على نفسية الحاكم المعتصم، وقرر نقل عاصمته وجنوده الأتراك لعدة أماكن خارج بغداد.
          فراح المعتصم يفتش عن موضع لبناء عاصمته الجديدة، فلما كان يتحرى المواضع، وصل إلى موضع يبعد عن بغداد 118 كم، وجد فيه
          ديرا للمسيحيين، فأقام فيه ثلاثة أيام ليتأكد له ملاءمة المحل، فاستحسنه واستطاب هواءه، واشترى أرض الدير بأربعة آلاف
          دينار، وأخذ في سنة ( 221 هـ ) بتخطيط مدينته التي سماها (سر من رأى) في ذلك الموضع، وذكر مصدر تأريخي أن المعتصم لما
          استقرت به الرغبة لاختيار موقع مدينة سامراء التي لم يكن فيها سوى ذلك الدير للنصارى، سأل الرهبان فيه عن اسم الموضع
          الذي هم فيه، فقال له بعض الرهبان: (نجد في كتبنا القديمة أن هذا الموضع يسمى سُرَّ من رأى وأنه كان في مدينة سام بن نوح
          وأنه سيعمر بعد دهور على يد ملك... فقال: أنا والله أبنيها وأنزلها وينزلها ولدي) وهكذا أمر المعتصم ببناء القصور والدور
          وجلب للمدينة الجديدة أصناف الشجر المثمر من جميع البلدان فغرست البساتين في كل مكان. وأشارت بعض المصادر التاريخية بأن
          المعتصم بعدما وقع اختياره برغبة شديدة على موقع سامراء وبناها، أمَر بأن يستقر الأتراك من مماليكه (عسكره وقادتهم) في
          أماكن خاصة من المدينة، وأمر أن لا يختلطوا بعناصر من مواطني دولته الآخرين فيها كي لا تفسد طاعتهم له، ولم تمضي زهاء
          ثلاث سنوات حتى قصدها الناس وشيدوا فيها مباني شاهقة وسميت بالعسكر والنسبة اليها عسكري، فأصبحت سامراء من المدن المهمة
          في عهد بني العباس وكان من ضمن العمران فيها أن شيد المعتصم ثكنات عسكرية لسكن (250) ألف جندي واصطبلات تستوعب (160) ألف
          حصان. ولا تُعرف مدينة اتسع عمرانها في بضع سنوات كما اتسع عمران مدينة سامراء، حتّى امتد العمران إلى مسافة (35)
          كيلومتراً على ضفتي نهر دجلة.
      
      
      
          أفول نجم سامراء العاصمة
      
      
      
          لما توفى مؤسس مدينة سامراء - العاصمة العباسية آنذاك - المعتصم سنة 227هـ، فقد تولى الحكم ولده هارون الواثق الذي توفى
          سنة 232هـ، فارتقى الحكم المتوكل بن المعتصم الذي كان من أشد حكام سامراء العباسيين ظلما على المسلمين من أتباع أهل
          البيت عليهم السلام حيث أمر سنة 236هـ بهدم قبر الإمام الحسين بن علي عليهما السلام في كربلاء وسط العراق، وهدم ما يحيطه
          من منازل وأبنية، ومنع الناس من زيارته كيلا يستلهموا من مرقده قيم الثورة التي طالما زرعها في نفوس الثائرين على الظلم
          في كل زمان ومكان، والمتوكل وأجداده وآبائه من الحكام كانوا من أشد الظلمة والجبابرة، فحاربوا رموز أضرحة آئمة الهدى
          وخلفاء النبي صلى الله عليه وآله، وهم الأحق - بنص الله عليهم – بالخلافة ممن تقلدوها ممن يدعون الإسلام زوراً وبهتاناً،
          فكان ظلمه سبباً رئيسياً في قتله من قبل ابنه الذي تولى الحكم من بعده. وهكذا تولى بعد المتوكل إبنه المنتصر ومن بعده
          تولى المستعين، والمعتزّ الذي كثرت في عصره الاضطرابات في سامراء سنة 253هـ ووافق أن استشهد الإمام علي الهادي عليه
          السلام على أيدي حكام بني العباس بسامراء وكان ذلك في 27جمادي الآخر سنة 254هـ، ولامتصاص نقمة الناس بعث المعتز بأخيه
          ابن أحمد المتوكل فصلى عليه في الشارع المعروف باسم شارع أبي أحمد، وهو من شوارع سامراء الرئيسية آنذاك، فلما كثر عدد
          الناس المشاركون في تشييع الإمام الهادي عليه السلام، وكثر بكاؤهم الشديد على مفارقته، ولتجنب انقلاب الناس على الحكم
          العباسي الغاشم، أصدر المعتز أمراً برد النعش إلى دار الإمام، فدفن فيه، وهو حالياً موقع مبنى العتبة العسكرية المقدسة
          التي تضم مرقدي الإمامين علي الهادي والحسن العسكري (عليهما والسلام ) وباقي أرحامهما من أهل البيت عليهم السلام. ثم ملك
          بعد المعتزّ، والمهتدي، وبعده المعتمد، حيث أنّ المدينة تركت بعد ذلك في عهده وأعاد مقر الحكم الإمبراطوري العباسي
          (المتسمي ظاهراً وزوراً وبهتاناً بالخلافة) إلى بغداد، ولم يكن قد مرّ على سامراء إلاّ أربع وخمسون سنة مَلَك خلالها
          ثمانية من أباطرة بني العباس (ما يسمى كذباً بالخلفاء) وهم: المعتصم، والواثق، والمتوكّل، والمنتصر، المستعين، والمعتزّ،
          والمهتدي، والمعتمد.
      
      
      
          وصف سامراء في العصر الحديث
      
      
      
          معالمها الأثرية كان يحيط بالمدينة سور مضلع على شكل يميل إلى الاستدارة، يبلغ طول محيطه 2 كم، ولايتجاوز قطره 680 م،
          مبني بالجص والآجر يصل ارتفاعه إلى 7 م، وكان له 19 برجا وأربعة ابواب، هي باب القاطول، وباب الناصرية، وباب الملطوش،
          وباب بغداد، وظل هذا السور ماثلا للعيان حتى سنة (1356هـ / 1936 م) . كانت تنتشر في أرجاء المدينة الحدائق العامة
          والخاصة، وفتح فيها في العقود الأخيرة متحف وضعت فيه المخطوطات والمصورات المهمة عن اثارها، وفي مدخل المدينة يقع مشروع
          الثرثار الذي يقي بغداد من الغرق، ومن معالمها الأثرية : المئذنة الملوية، والنافورة، قصر بلكوارا (شيده المعتز سنة
          247هـ)، قصر العاشق والمعشوق (شيده المعتمد العباسي سنة 264هـ)، قصر المعتصم (الجوسق الخاقاني)، قصر المختار، القصر
          الوزيري، قصر العروس، القصر الجعفري، مدينة المتوكلية (على بعد 15 كم شمال مدينة سامراء)، قصر الجص، بركة السباع، القبة
          الصليبية، دار العامة، تل الصوان، وسور سامراء. محلاتها وأحيائها العابد، البوجول، البوبدري، البونيسان، والمحلة
          الغربية، القاطول، القلعة، والمحلة الشرقية، وقد بدأ اتساع المدينة في العصر الحديث ليشمل عدة أحياء سكنية من ضمنها حي
          الضباط وحي الجبيرية وحي العرموشية وحي القادسية وحي المعلمين ولازال اتساع رقعة البناء قائما الى يومنا هذا. شوارعها
          شارع الخليج ، وشارع السريحة ( يعرف بشارع الاعظم ) ، وشارع الحير الاول ، وشارع أبي أحمد بن الرشيد ، وشارع برغمش
          التركي.. مساجدها جامع سامراء الكبير الذي شيده المعتصم عند بداية بناء المدينة سنة ( 221 هـ). المسجد الجامع لمدينة
          المتوكلية سنة 245 هـ والذي بناه الحاكم العباسي المتوكل وشيد ومئذنته الشهيرة ( الملوية ) الكبرى. جامع أبي دلف بملويته
          الثانية الذي يبعد نحو 15 كم عن شمال المدينة، وكلا الجامعين يعدان من الآثار العباسية المهمة في المدينة. جامع القلعة،
          مسجد حسن باشا، مسجد حميد الحسون، مسجد سيد درويش، مسجد البورحمان، مسجد علي بن أبي طالب عليه السلام، مسجد الحاج صالح
          الرحماني، ومسجد الأرقم، مسجد أولاد الحسن عليه السلام، جامع الفاروق.
      
      
      
          مراقدها ومقاماتها
      
      
      
          يعتبر مشهد الامامين علي الهادي والحسن العسكري عليهما السلام، أهم معالم مدينة سامراء، ويضم أيضاً مرقد السيدة نرجس زوج
          الإمام الحسن العسكري عليها السلام ( ت سنة260 هـ) ، وقبر السيدة حكيمة بنت الإمام الجواد عليه السلام ( ت سنة 260 هـ).
          قبة سرداب الغيبة الواقعة فوق سرداب بيت الأئمة الثلاثة علي الهادي والحسن العسكري ولحجة بن الحسن عليهم السلام. وتتبع
          لمدينة سامراء مدن أصغر منها وقرى تضم العديد من مراقد أهل البيت وأصحابهم عليهم السلام، وهي: مرقد السيد محمد بن الإمام
          علي الهادي عليه السلام ( ت سنة 252 هـ ) ( 261 هـ). مرقد الإمام محمد الدري الذي ينتهي نسبه إلى الإمام الكاظم عليه
          السلام ( ت سنة 300 هـ). مرقد بنات الكاظم عليهم السلام في ناحية الدجيل. مرقد بنات الحسن عليهم السلام في منطقة الجلام.
          مرقد آمنة بنت الإمام الحسن عليه السلام. مرقد إبراهيم بن مالك الإشتر النخعي رضي الله عنهما. مرقد الشيخ محمد الجاجيري
          ( ت سنة 590 هـ). مرقد الشيخ كمر بن هلال ( ت سنة 1200 هـ). مرقد أحمد الدنبلي الخوئي ( سلطان خوي ) ( ت سنة 1200 هـ).
          مرقد محمود الطهراني ( ت سنة 1304 هـ). مرقد مهدي الشيرازي ( ت سنة 1308 هـ). مرقد إبراهيم النوري ( ت سنة 1320 هـ).
          مرقد محسن الزنجاني ( ت سنة 1321 هـ).
      
          خزائنها ومكتباتها خزانة محمد بن عبدالملك الزيات، خزانة الفتح بن خاقان، الخزانة الكندية، خزانة علي بن يحيى المنجم،
          مكتبة العسكريين العامة، مكتبة الإمام محمد المهدي، مكتبة سامراء العامة، مكتبة ابن بطوطة، مخطوطات المكتبة العسكرية
          العامة في مدرسة الإمام الشيرازي ( قدس سره ).
      
          احتل الفرس هذه المنطقة في القرون التالية لميلاد نبي الله عيسى المسيح عليه السلام، واتخذوا من موقع سامراء الحصين
          مركزا استراتيجيا وعسكريا أثناء قتالهم الروم، وقد أقاموا فيها الحصن المعروف باسم حصن سومير، الذي جاء ذكره مع تراجع
          الجيوش الرومية ، بعد مقتل جوليان سنة 363 م. قام الحاكم العباسي هارون الرشيد بحفر أول نهر في المدينة وشيد قصراً له
          سمي باسمه، وأراد أن يبني مدينة في منطقة القاطول في سامراء لكنه لم يتمها. ( 198 ـ 218 هـ ): في عهد الحاكم العباسي
          المأمون بنيت قرية المطيرة والتي كانت من منتزهات بغداد وسامراء. سنة 221هـ: أسس المعتصم مدينة سامراء عاصمة
          امبراطوريتهم التي يُطلق عليه الدولة العباسية. من سنة (221 هـ ) إلى سنة ( 279 هـ ): جعل ستة حكام عباسيين (يسمون
          أنفسهم خلفاء) بعد المعتصم مدينة سامراء عاصمة لهم، هم المتوكل والمنتصر والمستعين والمعتز والمهتدي والمعتمد، وظلت مقرا
          للحكم (للخلافة) العباسي فترة تقرب من 58 عاماً. سنة ( 223 هـ ): وصل الافشين ( القائد العسكري للمعتصم ) مدينة سامراء
          ومعه بابك وأخوه اسيرين. سنة 245 هـ بنى الحاكم العباسي المتوكل مدينة المتوكلية وشيد المسجد الجامع ومئذنته الشهيرة (
          الملوية ) . سنة ( 247 هـ ): اغتيل المتوكل وتولى الحكم من بعده المنتصر، فانتقل إلى سامراء، وأمر الناس جميعا بالانتقال
          إلى الماحوزة، وأن يهدموا المنازل ويحملوا النقض إلى سامراء، وخربت قصور الجعفري ومنازله ومساكنه وأسواقه. سنة ( 254 هـ
          ): توفي الامام علي الهادي عليه السلام ودفن في داره. 15 شعبان المعظم سنة ( 255 هـ ): مولد خاتم الوصيين وآخر الخلفاء
          الشرعيين الإثني عشر للنبي محمد صلى الله عليه وآله، الإمام محمد المهدي الحجة بن الحسن العسكري عليهم السلام في دار
          أبيه وجده في سامراء. سنة (255هـ): بنى المتوكل لنفسه مدينة المتوكلية، واتخذها موقعا له ولأتباعه قرب سامراء حتى كادت
          الأخيرة تخلو من أهلها. ( بعد سنتي 254 هـ وسنة 260 هـ ): ولما استشهد الامامان علي الهادي والحسن العسكري عليهما
          السلام، اتخذ مرقداهما ومراقد عائلتهما المدفونون جميعاً في دارهم، مزاراً بنيت حوله العمارات وانشئت الدور والمنازل
          العامة فحافظت المدينة على عمرانها الى ما بعد انتهاء الدولة العباسية. سنة ( 333 هـ ): وسع ناصر الدولة الحمداني
          المدينة وأحاطها بسور. سنة ( 260 هـ ): سجنت سراري الامام الحسن العسكري عليه السلام وفي السنة نفسها توفي عليه السلام
          ودفن الى جوار ابيه عليه السلام. سنة ( 279 هـ ): ترك المعتمد المدينة ليتخذ من بغداد مستقرا وعاصمة له، قبل ستة أشهر من
          وفاته سنة ( 279 هـ )، وبعد أن رجوع الحكام (الخلفاء) العباسيون إلى بغداد ورجوعها عاصمة لهم، هجرت مدينة سامراء وأذن
          ذلك بخرابها. سنة ( 445 هـ ): وقعت حرب البساسيري والسلجوقيين في المدينة. سنة ( 1286 هـ / 1869 م ): أصدر والي بغداد
          مدحت باشا أمرا بجعل سامراء قضاءً تابعاً إلى بغداد، وكان أول قائم مقام لها هو علي بك. سنة ( 1296 هـ / 1879 م ): هاجم
          الهماوند ( جماعة من الاكراد ) مدينة سامراء ونهبوها. في سنة ( 1318 هـ ): صدرت من سامراء فتوى أطاحت بالمصالح الأجنبية
          المستغلة للشعوب المقهورة تحت إرادتها، حيث حاولت الشركات البريطانية احتكار زراعة وبيع التنباك في إيران، فتصدى زعيم
          الطائفة آنذاك باعتبار مسؤوليته عن أمن ومصلحة الأمة الإسلامية للأمر، وكان مقره في سامراء في العراق، وهو المرجع الديني
          آية الله العظمى الميرزا محمد حسن الشيرازي، وأصدر فتواه الشهيرة بتحريم بيع التنباك، فانهار اقتصاد تلك الشركات مما
          اضطر ملك إيران آنذاك إلى إلغاء الامتيازات، وتمت بذلك حماية مصالح المسلمين في ذلك البلد. سنة ( 1335 هـ / 1917 م ):
          احتل الانكليز مدينة سامراء إبان الحرب العالمية الاولى. سنة ( 1335 هـ ): صعد بعض السراق إلى مشهد الامامين علي الهادي
          والحسن العسكري عليهما السلام، وقلعوا 25 طابوقة مغلفة بالذهب من القبة الشريفة للمشهد. سنة ( 1343 هـ / 1924 م ): حدث
          وباء الكوليرا في المدينة، وكثرت الإصابات وارتفعت الوفيات، وهرب أغلب الاهالي منها. سنة ( 1920 م ): امتدت ثورة العشرين
          العراقية الكبرى ضد الاحتلال البريطاني الغاشم، إلى مدينة سامراء وشارك أهلها فيها مع أهلهم في سائر مناطق العراق. سنة (
          1359 هـ / 1941 م ): ثارت ثائرة أهالي سامراء ضد الجيش الانكليزي، عندما أخبرهم متصرف بغداد آنذاك بأن الانكليز يريدون
          احتلال محطة قطار سامراء، وقطع سكة الحديد في جنوب المدينة، وذلك في عهد حكومة رشيد عالي الكيلاني في 23 / مايس / 1941 م
          في عهد وصاية الأمير عبد الإله على ابن اخته الملك فيصل الثاني ملك العراق آنذاك. سنة ( 1250 هـ ): عمر الشيخ زين
          العابدين السلماني سور المدينة، وانفق على تعميره احد ملوك الهند. سنة ( 1258 هـ ): أعاد الملك أمجد علي شاه بناء سور
          المدينة وتعميره . سنة ( 1294 هـ / 1878 م ): أيام الدولة العثمانية نصب أول جسر على نهر دجلة يربط مدينة سامراء بالضفة
          الاخرى له. سنة ( 1258 هـ ) أعاد الملك أمجد علي شاه بناء سور المدينة وتعميره بواسطة السيد إبراهيم بن السيد باقر
          القزويني. أواسط القرن الثالث عشر الهجري: قام الميرزا محمد حسن الشيرازي بعدة أعمال في المدينة وجعلها مركزاً علمياً
          مرموقاً إذ بنى مدرسة علمية كبيرة لازالت باقية إلى اليوم. سنة ( 1952 م ): بوشر العمل بتنفيذ مشروع الثرثار الذي يعتبر
          من أهم المشاريع الاروائية في المدينة. سنة ( 1375 هـ / 1955 م ): أمرت الحكومة العراقية أيام حكم الملك فيصل الثاني بشق
          شارع يمتد من باب القاطول حتى باب العتبة العسكرية المقدسة، بعد تهديم الباب المذكور، وبنى صرحاً لها ودوراً للبلدية
          ومستشفى ومدرسة ودائرة للبرق والبريد. سنة ( 1299 هـ / 1881 م ): بنيت أول مدرسة ابتدائية في مدينة سامراء. سنة 1976م:
          الحقت المدينة كمركز قضاء تابع لمحافظة صلاح الدين بعد ان كانت تابعة بمعظم مدن هذه المحافظة الى محافظة بغداد. الأسبوع
          الأخير من شهر كانون الأول 2005م: صدور قانون إدارة العتبات المقدسة والمزارات الشيعية الشريفة ذي الرقم 19 لسنة 2005م
          من الجمعية الوطنية المنتخبة، والمستند إلى الدستور العراقي المصادق على شرعيته شعبياً في 15/10/2005م، والذي أرجع إدارة
          العتبة العسكرية المقدسة إلى ديوان الوقف الشيعي العراقي بعد أن كان تابعاً للوقف السني العراقي، الذين تشكلا بعد حل
          وزارة الأوقاف والشؤون الدينية العراقية، بعد أشهر من سقوط اللانظام الديكتاتوري في 9/4/2003م، ولكن للأسف لم تقبل إدارة
          الوقف السني الموقرة تنفيذ القانون وتسليم العتبة المقدسة إلى إدارة الوقف الشيعي. 22/2/2006م قام أزلام النظام السابق
          يعاونهم شُذاذ الآفاق من تنظيم القاعدة من خارج العراق بتنفيذ أكبر جريمة في تأريخ سامراء بعد قتل أئمتها علي الهادي
          والحسن العسكري عليهما السلام، ألا وهي فاجعة تفجير حرم مرقدهما وقبته الشريفة، والذي يُعد أكبر انتهاك لحرمتهما بعد
          شهادتهما، وهو خسارة كبيرة أيضاً لأهالي سامراء الكرام خصوصاً وللعراقيين عموماً، بهذا المصاب الجلل وفقدانهم أيضاً
          بناءٌ أثري يُعد الأقدم من بين عتبات العراق المقدسة بعمر يزيد على ألف سنة، وقد حصل التفجير بسبب سوء الوضع الأمني في
          المدينة وقلة حرس العتبة المعينين من قبل ديوان الوقف السني الموقر والبالغين خمسة أشخاص فقط، وسيطرة تنظيم القاعدة
          الإرهابي على المدينة. حزيران 2007م قام أزلام النظام السابق يعاونهم شُذاذ الآفاق من تنظيم القاعدة من خارج العراق
          بإكمال جريمتهم في الفاجعة السابقة، فهدّموا مئذنتي العتبة العسكرية المقدسة. نيسان 2008م بدء رحلة النصرة التي قام بها
          منتسبي العتبتين المقدستين الحسينية والعباسية بمعاونة (اللجنة الفنية لإعمار الروضة العسكرية الشريف) المعينة من رئاسة
          الوزراء العراقية، حيث تم رفع أنقاض الفاجعتين خلال 14 يوماً فقط بعد عجز الشركة التركية التي كانت الحكومة العراقية قد
          كلفتها بالإعمار عن رفع الأنقاض خلال عدة أشهر، وعلى إثر ذلك ألغى رئيس الوزراء العراقي آنذاك نوري كامل المالكي، عقد
          الشركة، وأوكل الأمر إلى اللجنة الفنية المذكورة. 17 نيسان 2009م (اللجنة الفنية لإعمار الروضة العسكرية الشريف) تنجز
          بناء حرم وقبة وهيكل منارتي مرقد الإمامين العسكريين عليهما السلام في 11 شهراً وبأيدي العراقيين فقط، بعد عجز الشركة
          التركية المذكورة عن الإعمار. 2010م البدء بإتوسيع حرم العسكريين عليهما السلام بنسبة 100% كمساحة أفقية، و200% كمجموع
          مساحة عمودية، إذ يتكون الحرم الجديد من طابقين.
        </p>
      </div>
      `;
  }
  constructor(){
    super();
  }
}
